{
  "vocab": {
    "PAD": 0,
    "BOS": 1,
    "EOS": 2,
    "UNK": 3,
    "TRACK_0": 4,
    "TRACK_24": 5,
    "TRACK_25": 6,
    "TRACK_27": 7,
    "TRACK_32": 8,
    "TRACK_33": 9,
    "TRACK_56": 10,
    "TRACK_57": 11,
    "TRACK_60": 12,
    "TRACK_65": 13,
    "TRACK_66": 14,
    "TRACK_67": 15,
    "TRACK_72": 16,
    "TRACK_73": 17,
    "TRACK_128": 18,
    "BEAT_0": 19,
    "BEAT_1": 20,
    "BEAT_2": 21,
    "BEAT_3": 22,
    "BEAT_4": 23,
    "BEAT_5": 24,
    "BEAT_6": 25,
    "BEAT_7": 26,
    "BEAT_8": 27,
    "BEAT_9": 28,
    "BEAT_10": 29,
    "BEAT_11": 30,
    "BEAT_12": 31,
    "BEAT_13": 32,
    "BEAT_14": 33,
    "BEAT_15": 34,
    "BEAT_16": 35,
    "BEAT_17": 36,
    "BEAT_18": 37,
    "BEAT_19": 38,
    "BEAT_20": 39,
    "BEAT_21": 40,
    "BEAT_22": 41,
    "BEAT_23": 42,
    "BEAT_24": 43,
    "BEAT_25": 44,
    "BEAT_26": 45,
    "BEAT_27": 46,
    "BEAT_28": 47,
    "BEAT_29": 48,
    "BEAT_30": 49,
    "BEAT_31": 50,
    "BEAT_32": 51,
    "BEAT_33": 52,
    "BEAT_34": 53,
    "BEAT_35": 54,
    "BEAT_36": 55,
    "BEAT_37": 56,
    "BEAT_38": 57,
    "BEAT_39": 58,
    "BEAT_40": 59,
    "BEAT_41": 60,
    "BEAT_42": 61,
    "BEAT_43": 62,
    "BEAT_44": 63,
    "BEAT_45": 64,
    "BEAT_46": 65,
    "BEAT_47": 66,
    "BEAT_48": 67,
    "BEAT_49": 68,
    "BEAT_50": 69,
    "BEAT_51": 70,
    "BEAT_52": 71,
    "BEAT_53": 72,
    "BEAT_54": 73,
    "BEAT_55": 74,
    "BEAT_56": 75,
    "BEAT_57": 76,
    "BEAT_58": 77,
    "BEAT_59": 78,
    "BEAT_60": 79,
    "BEAT_61": 80,
    "BEAT_62": 81,
    "BEAT_63": 82,
    "OFFSET_0": 83,
    "OFFSET_1": 84,
    "OFFSET_2": 85,
    "OFFSET_3": 86,
    "OFFSET_4": 87,
    "OFFSET_5": 88,
    "OFFSET_6": 89,
    "OFFSET_7": 90,
    "OFFSET_8": 91,
    "OFFSET_9": 92,
    "OFFSET_10": 93,
    "OFFSET_11": 94,
    "PATTERN_0": 95,
    "PATTERN_1": 96,
    "PATTERN_2": 97,
    "PATTERN_3": 98,
    "PATTERN_4": 99,
    "PATTERN_5": 100,
    "PATTERN_6": 101,
    "PATTERN_7": 102,
    "PATTERN_8": 103,
    "PATTERN_9": 104,
    "PATTERN_10": 105,
    "PATTERN_11": 106,
    "PATTERN_12": 107,
    "PATTERN_13": 108,
    "PATTERN_14": 109,
    "PATTERN_15": 110,
    "PATTERN_16": 111,
    "PATTERN_17": 112,
    "PATTERN_18": 113,
    "PATTERN_19": 114,
    "PATTERN_20": 115,
    "PATTERN_21": 116,
    "PATTERN_22": 117,
    "PATTERN_23": 118,
    "PATTERN_24": 119,
    "PATTERN_25": 120,
    "PATTERN_26": 121,
    "PATTERN_27": 122,
    "PATTERN_28": 123,
    "PATTERN_29": 124,
    "PATTERN_30": 125,
    "PATTERN_31": 126,
    "PATTERN_32": 127,
    "PATTERN_33": 128,
    "PATTERN_34": 129,
    "PATTERN_35": 130,
    "PATTERN_36": 131,
    "PATTERN_37": 132,
    "PATTERN_38": 133,
    "PATTERN_39": 134,
    "PATTERN_40": 135,
    "PATTERN_41": 136,
    "PATTERN_42": 137,
    "PATTERN_43": 138,
    "PATTERN_44": 139,
    "PATTERN_45": 140,
    "PATTERN_46": 141,
    "PATTERN_47": 142,
    "PATTERN_48": 143,
    "PATTERN_49": 144,
    "PATTERN_50": 145,
    "PATTERN_51": 146,
    "PATTERN_52": 147,
    "PATTERN_53": 148,
    "PATTERN_54": 149,
    "PATTERN_55": 150,
    "PATTERN_56": 151,
    "PATTERN_57": 152,
    "PATTERN_58": 153,
    "PATTERN_59": 154,
    "PATTERN_60": 155,
    "PATTERN_61": 156,
    "PATTERN_62": 157,
    "PATTERN_63": 158,
    "PATTERN_64": 159,
    "PATTERN_65": 160,
    "PATTERN_66": 161,
    "PATTERN_67": 162,
    "PATTERN_68": 163,
    "PATTERN_69": 164,
    "PATTERN_70": 165,
    "PATTERN_71": 166,
    "PATTERN_72": 167,
    "PATTERN_73": 168,
    "PATTERN_74": 169,
    "PATTERN_75": 170,
    "PATTERN_76": 171,
    "PATTERN_77": 172,
    "PATTERN_78": 173,
    "PATTERN_79": 174,
    "PATTERN_80": 175,
    "PATTERN_81": 176,
    "PATTERN_82": 177,
    "PATTERN_83": 178,
    "PATTERN_84": 179,
    "PATTERN_85": 180,
    "PATTERN_86": 181,
    "PATTERN_87": 182,
    "PATTERN_88": 183,
    "PATTERN_89": 184,
    "PATTERN_90": 185,
    "PATTERN_91": 186,
    "PATTERN_92": 187,
    "PATTERN_93": 188,
    "PATTERN_94": 189,
    "PATTERN_95": 190,
    "PATTERN_96": 191,
    "PATTERN_97": 192,
    "PATTERN_98": 193,
    "PATTERN_99": 194,
    "PATTERN_100": 195,
    "PATTERN_101": 196,
    "PATTERN_102": 197,
    "PATTERN_103": 198,
    "PATTERN_104": 199,
    "PATTERN_105": 200,
    "PATTERN_106": 201,
    "PATTERN_107": 202,
    "PATTERN_108": 203,
    "PATTERN_109": 204,
    "PATTERN_110": 205,
    "PATTERN_111": 206,
    "PATTERN_112": 207,
    "PATTERN_113": 208,
    "PATTERN_114": 209,
    "PATTERN_115": 210,
    "PATTERN_116": 211,
    "PATTERN_117": 212,
    "PATTERN_118": 213,
    "PATTERN_119": 214,
    "PATTERN_120": 215,
    "PATTERN_121": 216,
    "PATTERN_122": 217,
    "PATTERN_123": 218,
    "PATTERN_124": 219,
    "PATTERN_125": 220,
    "PATTERN_126": 221,
    "PATTERN_127": 222,
    "PATTERN_128": 223,
    "PATTERN_129": 224,
    "PATTERN_130": 225,
    "PATTERN_131": 226,
    "PATTERN_132": 227,
    "PATTERN_133": 228,
    "PATTERN_134": 229,
    "PATTERN_135": 230,
    "PATTERN_136": 231,
    "PATTERN_137": 232,
    "PATTERN_138": 233,
    "PATTERN_139": 234,
    "PATTERN_140": 235,
    "PATTERN_141": 236,
    "PATTERN_142": 237,
    "PATTERN_143": 238,
    "PATTERN_144": 239,
    "PATTERN_145": 240,
    "PATTERN_146": 241,
    "PATTERN_147": 242,
    "PATTERN_148": 243,
    "PATTERN_149": 244,
    "PATTERN_150": 245,
    "PATTERN_151": 246,
    "PATTERN_152": 247,
    "PATTERN_153": 248,
    "PATTERN_154": 249,
    "PATTERN_155": 250,
    "PATTERN_156": 251,
    "PATTERN_157": 252,
    "PATTERN_158": 253,
    "PATTERN_159": 254,
    "PATTERN_160": 255,
    "PATTERN_161": 256,
    "PATTERN_162": 257,
    "PATTERN_163": 258,
    "PATTERN_164": 259,
    "PATTERN_165": 260,
    "PATTERN_166": 261,
    "PATTERN_167": 262,
    "PATTERN_168": 263,
    "PATTERN_169": 264,
    "PATTERN_170": 265,
    "PATTERN_171": 266,
    "PATTERN_172": 267,
    "PATTERN_173": 268,
    "PATTERN_174": 269,
    "PATTERN_175": 270,
    "PATTERN_176": 271,
    "PATTERN_177": 272,
    "PATTERN_178": 273,
    "PATTERN_179": 274,
    "PATTERN_180": 275,
    "PATTERN_181": 276,
    "PATTERN_182": 277,
    "PATTERN_183": 278,
    "PATTERN_184": 279,
    "PATTERN_185": 280,
    "PATTERN_186": 281,
    "PATTERN_187": 282,
    "PATTERN_188": 283,
    "PATTERN_189": 284,
    "PATTERN_190": 285,
    "PATTERN_191": 286,
    "PATTERN_192": 287,
    "PATTERN_193": 288,
    "PATTERN_194": 289,
    "PATTERN_195": 290,
    "PATTERN_196": 291,
    "PATTERN_197": 292,
    "PATTERN_198": 293,
    "PATTERN_199": 294,
    "PATTERN_200": 295,
    "PATTERN_201": 296,
    "PATTERN_202": 297,
    "PATTERN_203": 298,
    "PATTERN_204": 299,
    "PATTERN_205": 300,
    "PATTERN_206": 301,
    "PATTERN_207": 302,
    "PATTERN_208": 303,
    "PATTERN_209": 304,
    "PATTERN_210": 305,
    "PATTERN_211": 306,
    "PATTERN_212": 307,
    "PATTERN_213": 308,
    "PATTERN_214": 309,
    "PATTERN_215": 310,
    "PATTERN_216": 311,
    "PATTERN_217": 312,
    "PATTERN_218": 313,
    "PATTERN_219": 314,
    "PATTERN_220": 315,
    "PATTERN_221": 316,
    "PATTERN_222": 317,
    "PATTERN_223": 318,
    "PATTERN_224": 319,
    "PATTERN_225": 320,
    "PATTERN_226": 321,
    "PATTERN_227": 322,
    "PATTERN_228": 323,
    "PATTERN_229": 324,
    "PATTERN_230": 325,
    "PATTERN_231": 326,
    "PATTERN_232": 327,
    "PATTERN_233": 328,
    "PATTERN_234": 329,
    "PATTERN_235": 330,
    "PATTERN_236": 331,
    "PATTERN_237": 332,
    "PATTERN_238": 333,
    "PATTERN_239": 334,
    "PATTERN_240": 335,
    "PATTERN_241": 336,
    "PATTERN_242": 337,
    "PATTERN_243": 338,
    "PATTERN_244": 339,
    "PATTERN_245": 340,
    "PATTERN_246": 341,
    "PATTERN_247": 342,
    "PATTERN_248": 343,
    "PATTERN_249": 344,
    "PATTERN_250": 345,
    "PATTERN_251": 346,
    "PATTERN_252": 347,
    "PATTERN_253": 348,
    "PATTERN_254": 349,
    "PATTERN_255": 350,
    "PATTERN_256": 351,
    "PATTERN_257": 352,
    "PATTERN_258": 353,
    "PATTERN_259": 354,
    "PATTERN_260": 355,
    "PATTERN_261": 356,
    "PATTERN_262": 357,
    "PATTERN_263": 358,
    "PATTERN_264": 359,
    "PATTERN_265": 360,
    "PATTERN_266": 361,
    "PATTERN_267": 362,
    "PATTERN_268": 363,
    "PATTERN_269": 364,
    "PATTERN_270": 365,
    "PATTERN_271": 366,
    "PATTERN_272": 367,
    "PATTERN_273": 368,
    "PATTERN_274": 369,
    "PATTERN_275": 370,
    "PATTERN_276": 371,
    "PATTERN_277": 372,
    "PATTERN_278": 373,
    "PATTERN_279": 374,
    "PATTERN_280": 375,
    "PATTERN_281": 376,
    "PATTERN_282": 377,
    "PATTERN_283": 378,
    "PATTERN_284": 379,
    "PATTERN_285": 380,
    "PATTERN_286": 381,
    "PATTERN_287": 382,
    "PATTERN_288": 383,
    "PATTERN_289": 384,
    "PATTERN_290": 385,
    "PATTERN_291": 386,
    "PATTERN_292": 387,
    "PATTERN_293": 388,
    "PATTERN_294": 389,
    "PATTERN_295": 390,
    "PATTERN_296": 391,
    "PATTERN_297": 392,
    "PATTERN_298": 393,
    "PATTERN_299": 394,
    "PATTERN_300": 395,
    "PATTERN_301": 396,
    "PATTERN_302": 397,
    "PATTERN_303": 398,
    "PATTERN_304": 399,
    "PATTERN_305": 400,
    "PATTERN_306": 401,
    "PATTERN_307": 402,
    "PATTERN_308": 403,
    "PATTERN_309": 404,
    "PATTERN_310": 405,
    "PATTERN_311": 406,
    "PATTERN_312": 407,
    "PATTERN_313": 408,
    "PATTERN_314": 409,
    "PATTERN_315": 410,
    "PATTERN_316": 411,
    "PATTERN_317": 412,
    "PATTERN_318": 413,
    "PATTERN_319": 414,
    "PATTERN_320": 415,
    "PATTERN_321": 416,
    "PATTERN_322": 417,
    "PATTERN_323": 418,
    "PATTERN_324": 419,
    "PATTERN_325": 420,
    "PATTERN_326": 421,
    "PATTERN_327": 422,
    "PATTERN_328": 423,
    "PATTERN_329": 424,
    "PATTERN_330": 425,
    "PATTERN_331": 426,
    "PATTERN_332": 427,
    "PATTERN_333": 428,
    "PATTERN_334": 429,
    "PATTERN_335": 430,
    "PATTERN_336": 431,
    "PATTERN_337": 432,
    "PATTERN_338": 433,
    "PATTERN_339": 434,
    "PATTERN_340": 435,
    "PATTERN_341": 436,
    "PATTERN_342": 437,
    "PATTERN_343": 438,
    "PATTERN_344": 439,
    "PATTERN_345": 440,
    "PATTERN_346": 441,
    "PATTERN_347": 442,
    "PATTERN_348": 443,
    "PATTERN_349": 444,
    "PATTERN_350": 445,
    "PATTERN_351": 446,
    "PATTERN_352": 447,
    "PATTERN_353": 448,
    "PATTERN_354": 449,
    "PATTERN_355": 450,
    "PATTERN_356": 451,
    "PATTERN_357": 452,
    "PATTERN_358": 453,
    "PATTERN_359": 454,
    "PATTERN_360": 455,
    "PATTERN_361": 456,
    "PATTERN_362": 457,
    "PATTERN_363": 458,
    "PATTERN_364": 459,
    "PATTERN_365": 460,
    "PATTERN_366": 461,
    "PATTERN_367": 462,
    "PATTERN_368": 463,
    "PATTERN_369": 464,
    "PATTERN_370": 465,
    "PATTERN_371": 466,
    "PATTERN_372": 467,
    "PATTERN_373": 468,
    "PATTERN_374": 469,
    "PATTERN_375": 470,
    "PATTERN_376": 471,
    "PATTERN_377": 472,
    "PATTERN_378": 473,
    "PATTERN_379": 474,
    "PATTERN_380": 475,
    "PATTERN_381": 476,
    "PATTERN_382": 477,
    "PATTERN_383": 478,
    "PATTERN_384": 479,
    "PATTERN_385": 480,
    "PATTERN_386": 481,
    "PATTERN_387": 482,
    "PATTERN_388": 483,
    "PATTERN_389": 484,
    "PATTERN_390": 485,
    "PATTERN_391": 486,
    "PATTERN_392": 487,
    "PATTERN_393": 488,
    "PATTERN_394": 489,
    "PATTERN_395": 490,
    "PATTERN_396": 491,
    "PATTERN_397": 492,
    "PATTERN_398": 493,
    "PATTERN_399": 494,
    "PATTERN_400": 495,
    "PATTERN_401": 496,
    "PATTERN_402": 497,
    "PATTERN_403": 498,
    "PATTERN_404": 499,
    "PATTERN_405": 500,
    "PATTERN_406": 501,
    "PATTERN_407": 502,
    "PATTERN_408": 503,
    "PATTERN_409": 504,
    "PATTERN_410": 505,
    "PATTERN_411": 506,
    "PATTERN_412": 507,
    "PATTERN_413": 508,
    "PATTERN_414": 509,
    "PATTERN_415": 510,
    "PATTERN_416": 511,
    "PATTERN_417": 512,
    "PATTERN_418": 513,
    "PATTERN_419": 514,
    "PATTERN_420": 515,
    "PATTERN_421": 516,
    "PATTERN_422": 517,
    "PATTERN_423": 518,
    "PATTERN_424": 519,
    "PATTERN_425": 520,
    "PATTERN_426": 521,
    "PATTERN_427": 522,
    "PATTERN_428": 523,
    "PATTERN_429": 524,
    "PATTERN_430": 525,
    "PATTERN_431": 526,
    "PATTERN_432": 527,
    "PATTERN_433": 528,
    "PATTERN_434": 529,
    "PATTERN_435": 530,
    "PATTERN_436": 531,
    "PATTERN_437": 532,
    "PATTERN_438": 533,
    "PATTERN_439": 534,
    "PATTERN_440": 535,
    "PATTERN_441": 536,
    "PATTERN_442": 537,
    "PATTERN_443": 538,
    "PATTERN_444": 539,
    "PATTERN_445": 540,
    "PATTERN_446": 541,
    "PATTERN_447": 542,
    "PATTERN_448": 543,
    "PATTERN_449": 544,
    "PATTERN_450": 545,
    "PATTERN_451": 546,
    "PATTERN_452": 547,
    "PATTERN_453": 548,
    "PATTERN_454": 549,
    "PATTERN_455": 550,
    "PATTERN_456": 551,
    "PATTERN_457": 552,
    "PATTERN_458": 553,
    "PATTERN_459": 554,
    "PATTERN_460": 555,
    "PATTERN_461": 556,
    "PATTERN_462": 557,
    "PATTERN_463": 558,
    "PATTERN_464": 559,
    "PATTERN_465": 560,
    "PATTERN_466": 561,
    "PATTERN_467": 562,
    "PATTERN_468": 563,
    "PATTERN_469": 564,
    "PATTERN_470": 565,
    "PATTERN_471": 566,
    "PATTERN_472": 567,
    "PATTERN_473": 568,
    "PATTERN_474": 569,
    "PATTERN_475": 570,
    "PATTERN_476": 571,
    "PATTERN_477": 572,
    "PATTERN_478": 573,
    "PATTERN_479": 574,
    "PATTERN_480": 575,
    "PATTERN_481": 576,
    "PATTERN_482": 577,
    "PATTERN_483": 578,
    "PATTERN_484": 579,
    "PATTERN_485": 580,
    "PATTERN_486": 581,
    "PATTERN_487": 582,
    "PATTERN_488": 583,
    "PATTERN_489": 584,
    "PATTERN_490": 585,
    "PATTERN_491": 586,
    "PATTERN_492": 587,
    "PATTERN_493": 588,
    "PATTERN_494": 589,
    "PATTERN_495": 590,
    "PATTERN_496": 591,
    "PATTERN_497": 592,
    "PATTERN_498": 593,
    "PATTERN_499": 594,
    "PATTERN_500": 595,
    "PATTERN_501": 596,
    "PATTERN_502": 597,
    "PATTERN_503": 598,
    "PATTERN_504": 599,
    "PATTERN_505": 600,
    "PATTERN_506": 601,
    "PATTERN_507": 602,
    "PATTERN_508": 603,
    "PATTERN_509": 604,
    "PATTERN_510": 605,
    "PATTERN_511": 606,
    "PATTERN_512": 607,
    "PATTERN_513": 608,
    "PATTERN_514": 609,
    "PATTERN_515": 610,
    "PATTERN_516": 611,
    "PATTERN_517": 612,
    "PATTERN_518": 613,
    "PATTERN_519": 614,
    "PATTERN_520": 615,
    "PATTERN_521": 616,
    "PATTERN_522": 617,
    "PATTERN_523": 618,
    "PATTERN_524": 619,
    "PATTERN_525": 620,
    "PATTERN_526": 621,
    "PATTERN_527": 622,
    "PATTERN_528": 623,
    "PATTERN_529": 624,
    "PATTERN_530": 625,
    "PATTERN_531": 626,
    "PATTERN_532": 627,
    "PATTERN_533": 628,
    "PATTERN_534": 629,
    "PATTERN_535": 630,
    "PATTERN_536": 631,
    "PATTERN_537": 632,
    "PATTERN_538": 633,
    "PATTERN_539": 634,
    "PATTERN_540": 635,
    "PATTERN_541": 636,
    "PATTERN_542": 637,
    "PATTERN_543": 638,
    "PATTERN_544": 639,
    "PATTERN_545": 640,
    "PATTERN_546": 641,
    "PATTERN_547": 642,
    "PATTERN_548": 643,
    "PATTERN_549": 644,
    "PATTERN_550": 645,
    "PATTERN_551": 646,
    "PATTERN_552": 647,
    "PATTERN_553": 648,
    "PATTERN_554": 649,
    "PATTERN_555": 650,
    "PATTERN_556": 651,
    "PATTERN_557": 652,
    "PATTERN_558": 653,
    "PATTERN_559": 654,
    "PATTERN_560": 655,
    "PATTERN_561": 656,
    "PATTERN_562": 657,
    "PATTERN_563": 658,
    "PATTERN_564": 659,
    "PATTERN_565": 660,
    "PATTERN_566": 661,
    "PATTERN_567": 662,
    "PATTERN_568": 663,
    "PATTERN_569": 664,
    "PATTERN_570": 665,
    "PATTERN_571": 666,
    "PATTERN_572": 667,
    "PATTERN_573": 668,
    "PATTERN_574": 669,
    "PATTERN_575": 670,
    "PATTERN_576": 671,
    "PATTERN_577": 672,
    "PATTERN_578": 673,
    "PATTERN_579": 674,
    "PATTERN_580": 675,
    "PATTERN_581": 676,
    "PATTERN_582": 677,
    "PATTERN_583": 678,
    "PATTERN_584": 679,
    "PATTERN_585": 680,
    "PATTERN_586": 681,
    "PATTERN_587": 682,
    "PATTERN_588": 683,
    "PATTERN_589": 684,
    "PATTERN_590": 685,
    "PATTERN_591": 686,
    "PATTERN_592": 687,
    "PATTERN_593": 688,
    "PATTERN_594": 689,
    "PATTERN_595": 690,
    "PATTERN_596": 691,
    "PATTERN_597": 692,
    "PATTERN_598": 693,
    "PATTERN_599": 694,
    "PATTERN_600": 695,
    "PATTERN_601": 696,
    "PATTERN_602": 697,
    "PATTERN_603": 698,
    "PATTERN_604": 699,
    "PATTERN_605": 700,
    "PATTERN_606": 701,
    "PATTERN_607": 702,
    "PATTERN_608": 703,
    "PATTERN_609": 704,
    "PATTERN_610": 705,
    "PATTERN_611": 706,
    "PATTERN_612": 707,
    "PATTERN_613": 708,
    "PATTERN_614": 709,
    "PATTERN_615": 710,
    "PATTERN_616": 711,
    "PATTERN_617": 712,
    "PATTERN_618": 713,
    "PATTERN_619": 714,
    "PATTERN_620": 715,
    "PATTERN_621": 716,
    "PATTERN_622": 717,
    "PATTERN_623": 718,
    "PATTERN_624": 719,
    "PATTERN_625": 720,
    "PATTERN_626": 721,
    "PATTERN_627": 722,
    "PATTERN_628": 723,
    "PATTERN_629": 724,
    "PATTERN_630": 725,
    "PATTERN_631": 726,
    "PATTERN_632": 727,
    "PATTERN_633": 728,
    "PATTERN_634": 729,
    "PATTERN_635": 730,
    "PATTERN_636": 731,
    "PATTERN_637": 732,
    "PATTERN_638": 733,
    "PATTERN_639": 734,
    "PATTERN_640": 735,
    "PATTERN_641": 736,
    "PATTERN_642": 737,
    "PATTERN_643": 738,
    "PATTERN_644": 739,
    "PATTERN_645": 740,
    "PATTERN_646": 741,
    "PATTERN_647": 742,
    "PATTERN_648": 743,
    "PATTERN_649": 744,
    "PATTERN_650": 745,
    "PATTERN_651": 746,
    "PATTERN_652": 747,
    "PATTERN_653": 748,
    "PATTERN_654": 749,
    "PATTERN_655": 750,
    "PATTERN_656": 751,
    "PATTERN_657": 752,
    "PATTERN_658": 753,
    "PATTERN_659": 754,
    "PATTERN_660": 755,
    "PATTERN_661": 756,
    "PATTERN_662": 757,
    "PATTERN_663": 758,
    "PATTERN_664": 759,
    "PATTERN_665": 760,
    "PATTERN_666": 761,
    "PATTERN_667": 762,
    "PATTERN_668": 763,
    "PATTERN_669": 764,
    "PATTERN_670": 765,
    "PATTERN_671": 766,
    "PATTERN_672": 767,
    "PATTERN_673": 768,
    "PATTERN_674": 769,
    "PATTERN_675": 770,
    "PATTERN_676": 771,
    "PATTERN_677": 772,
    "PATTERN_678": 773,
    "PATTERN_679": 774,
    "PATTERN_680": 775,
    "PATTERN_681": 776,
    "PATTERN_682": 777,
    "PATTERN_683": 778,
    "PATTERN_684": 779,
    "PATTERN_685": 780,
    "PATTERN_686": 781,
    "PATTERN_687": 782,
    "PATTERN_688": 783,
    "PATTERN_689": 784,
    "PATTERN_690": 785,
    "PATTERN_691": 786,
    "PATTERN_692": 787,
    "PATTERN_693": 788,
    "PATTERN_694": 789,
    "PATTERN_695": 790,
    "PATTERN_696": 791,
    "PATTERN_697": 792,
    "PATTERN_698": 793,
    "PATTERN_699": 794,
    "PATTERN_700": 795,
    "PATTERN_701": 796,
    "PATTERN_702": 797,
    "PATTERN_703": 798,
    "PATTERN_704": 799,
    "PATTERN_705": 800,
    "PATTERN_706": 801,
    "PATTERN_707": 802,
    "PATTERN_708": 803,
    "PATTERN_709": 804,
    "PATTERN_710": 805,
    "PATTERN_711": 806,
    "PATTERN_712": 807,
    "PATTERN_713": 808,
    "PATTERN_714": 809,
    "PATTERN_715": 810,
    "PATTERN_716": 811,
    "PATTERN_717": 812,
    "PATTERN_718": 813,
    "PATTERN_719": 814,
    "PATTERN_720": 815,
    "PATTERN_721": 816,
    "PATTERN_722": 817,
    "PATTERN_723": 818,
    "PATTERN_724": 819,
    "PATTERN_725": 820,
    "PATTERN_726": 821,
    "PATTERN_727": 822,
    "PATTERN_728": 823,
    "PATTERN_729": 824,
    "PATTERN_730": 825,
    "PATTERN_731": 826,
    "PATTERN_732": 827,
    "PATTERN_733": 828,
    "PATTERN_734": 829,
    "PATTERN_735": 830,
    "PATTERN_736": 831,
    "PATTERN_737": 832,
    "PATTERN_738": 833,
    "PATTERN_739": 834,
    "PATTERN_740": 835,
    "PATTERN_741": 836,
    "PATTERN_742": 837,
    "PATTERN_743": 838,
    "PATTERN_744": 839,
    "PATTERN_745": 840,
    "PATTERN_746": 841,
    "PATTERN_747": 842,
    "PATTERN_748": 843,
    "PATTERN_749": 844,
    "PATTERN_750": 845,
    "PATTERN_751": 846,
    "PATTERN_752": 847,
    "PATTERN_753": 848,
    "PATTERN_754": 849,
    "PATTERN_755": 850,
    "PATTERN_756": 851,
    "PATTERN_757": 852,
    "PATTERN_758": 853,
    "PATTERN_759": 854,
    "PATTERN_760": 855,
    "PATTERN_761": 856,
    "PATTERN_762": 857,
    "PATTERN_763": 858,
    "PATTERN_764": 859,
    "PATTERN_765": 860,
    "PATTERN_766": 861,
    "PATTERN_767": 862,
    "PATTERN_768": 863,
    "PATTERN_769": 864,
    "PATTERN_770": 865,
    "PATTERN_771": 866,
    "PATTERN_772": 867,
    "PATTERN_773": 868,
    "PATTERN_774": 869,
    "PATTERN_775": 870,
    "PATTERN_776": 871,
    "PATTERN_777": 872,
    "PATTERN_778": 873,
    "PATTERN_779": 874,
    "PATTERN_780": 875,
    "PATTERN_781": 876,
    "PATTERN_782": 877,
    "PATTERN_783": 878,
    "PATTERN_784": 879,
    "PATTERN_785": 880,
    "PATTERN_786": 881,
    "PATTERN_787": 882,
    "PATTERN_788": 883,
    "PATTERN_789": 884,
    "PATTERN_790": 885,
    "PATTERN_791": 886,
    "PATTERN_792": 887,
    "PATTERN_793": 888,
    "PATTERN_794": 889,
    "PATTERN_795": 890,
    "PATTERN_796": 891,
    "PATTERN_797": 892,
    "PATTERN_798": 893,
    "PATTERN_799": 894,
    "PATTERN_800": 895,
    "PATTERN_801": 896,
    "PATTERN_802": 897,
    "PATTERN_803": 898,
    "PATTERN_804": 899,
    "PATTERN_805": 900,
    "PATTERN_806": 901,
    "PATTERN_807": 902,
    "PATTERN_808": 903,
    "PATTERN_809": 904,
    "PATTERN_810": 905,
    "PATTERN_811": 906,
    "PATTERN_812": 907,
    "PATTERN_813": 908,
    "PATTERN_814": 909,
    "PATTERN_815": 910,
    "PATTERN_816": 911,
    "PATTERN_817": 912,
    "PATTERN_818": 913,
    "PATTERN_819": 914,
    "PATTERN_820": 915,
    "PATTERN_821": 916,
    "PATTERN_822": 917,
    "PATTERN_823": 918,
    "PATTERN_824": 919,
    "PATTERN_825": 920,
    "PATTERN_826": 921,
    "PATTERN_827": 922,
    "PATTERN_828": 923,
    "PATTERN_829": 924,
    "PATTERN_830": 925,
    "PATTERN_831": 926,
    "PATTERN_832": 927,
    "PATTERN_833": 928,
    "PATTERN_834": 929,
    "PATTERN_835": 930,
    "PATTERN_836": 931,
    "PATTERN_837": 932,
    "PATTERN_838": 933,
    "PATTERN_839": 934,
    "PATTERN_840": 935,
    "PATTERN_841": 936,
    "PATTERN_842": 937,
    "PATTERN_843": 938,
    "PATTERN_844": 939,
    "PATTERN_845": 940,
    "PATTERN_846": 941,
    "PATTERN_847": 942,
    "PATTERN_848": 943,
    "PATTERN_849": 944,
    "PATTERN_850": 945,
    "PATTERN_851": 946,
    "PATTERN_852": 947,
    "PATTERN_853": 948,
    "PATTERN_854": 949,
    "PATTERN_855": 950,
    "PATTERN_856": 951,
    "PATTERN_857": 952,
    "PATTERN_858": 953,
    "PATTERN_859": 954,
    "PATTERN_860": 955,
    "PATTERN_861": 956,
    "PATTERN_862": 957,
    "PATTERN_863": 958,
    "PATTERN_864": 959,
    "PATTERN_865": 960,
    "PATTERN_866": 961,
    "PATTERN_867": 962,
    "PATTERN_868": 963,
    "PATTERN_869": 964,
    "PATTERN_870": 965,
    "PATTERN_871": 966,
    "PATTERN_872": 967,
    "PATTERN_873": 968,
    "PATTERN_874": 969,
    "PATTERN_875": 970,
    "PATTERN_876": 971,
    "PATTERN_877": 972,
    "PATTERN_878": 973,
    "PATTERN_879": 974,
    "PATTERN_880": 975,
    "PATTERN_881": 976,
    "PATTERN_882": 977,
    "PATTERN_883": 978,
    "PATTERN_884": 979,
    "PATTERN_885": 980,
    "PATTERN_886": 981,
    "PATTERN_887": 982,
    "PATTERN_888": 983,
    "PATTERN_889": 984,
    "PATTERN_890": 985,
    "PATTERN_891": 986,
    "PATTERN_892": 987,
    "PATTERN_893": 988,
    "PATTERN_894": 989,
    "PATTERN_895": 990,
    "PATTERN_896": 991,
    "PATTERN_897": 992,
    "PATTERN_898": 993,
    "PATTERN_899": 994,
    "PATTERN_900": 995,
    "PATTERN_901": 996,
    "PATTERN_902": 997,
    "PATTERN_903": 998,
    "PATTERN_904": 999,
    "PATTERN_905": 1000,
    "PATTERN_906": 1001,
    "PATTERN_907": 1002,
    "PATTERN_908": 1003,
    "PATTERN_909": 1004,
    "PATTERN_910": 1005,
    "PATTERN_911": 1006,
    "PATTERN_912": 1007,
    "PATTERN_913": 1008,
    "PATTERN_914": 1009,
    "PATTERN_915": 1010,
    "PATTERN_916": 1011,
    "PATTERN_917": 1012,
    "PATTERN_918": 1013,
    "PATTERN_919": 1014,
    "PATTERN_920": 1015,
    "PATTERN_921": 1016,
    "PATTERN_922": 1017,
    "PATTERN_923": 1018,
    "PATTERN_924": 1019,
    "PATTERN_925": 1020,
    "PATTERN_926": 1021,
    "PATTERN_927": 1022,
    "PATTERN_928": 1023,
    "PATTERN_929": 1024,
    "PATTERN_930": 1025,
    "PATTERN_931": 1026,
    "PATTERN_932": 1027,
    "PATTERN_933": 1028,
    "PATTERN_934": 1029,
    "PATTERN_935": 1030,
    "PATTERN_936": 1031,
    "PATTERN_937": 1032,
    "PATTERN_938": 1033,
    "PATTERN_939": 1034,
    "PATTERN_940": 1035,
    "PATTERN_941": 1036,
    "PATTERN_942": 1037,
    "PATTERN_943": 1038,
    "PATTERN_944": 1039,
    "PATTERN_945": 1040,
    "PATTERN_946": 1041,
    "PATTERN_947": 1042,
    "PATTERN_948": 1043,
    "PATTERN_949": 1044,
    "PATTERN_950": 1045,
    "PATTERN_951": 1046,
    "PATTERN_952": 1047,
    "PATTERN_953": 1048,
    "PATTERN_954": 1049,
    "PATTERN_955": 1050,
    "PATTERN_956": 1051,
    "PATTERN_957": 1052,
    "PATTERN_958": 1053,
    "PATTERN_959": 1054,
    "PATTERN_960": 1055,
    "PATTERN_961": 1056,
    "PATTERN_962": 1057,
    "PATTERN_963": 1058,
    "PATTERN_964": 1059,
    "PATTERN_965": 1060,
    "PATTERN_966": 1061,
    "PATTERN_967": 1062,
    "PATTERN_968": 1063,
    "PATTERN_969": 1064,
    "PATTERN_970": 1065,
    "PATTERN_971": 1066,
    "PATTERN_972": 1067,
    "PATTERN_973": 1068,
    "PATTERN_974": 1069,
    "PATTERN_975": 1070,
    "PATTERN_976": 1071,
    "PATTERN_977": 1072,
    "PATTERN_978": 1073,
    "PATTERN_979": 1074,
    "PATTERN_980": 1075,
    "PATTERN_981": 1076,
    "PATTERN_982": 1077,
    "PATTERN_983": 1078,
    "PATTERN_984": 1079,
    "PATTERN_985": 1080,
    "PATTERN_986": 1081,
    "PATTERN_987": 1082,
    "PATTERN_988": 1083,
    "PATTERN_989": 1084,
    "PATTERN_990": 1085,
    "PATTERN_991": 1086,
    "PATTERN_992": 1087,
    "PATTERN_993": 1088,
    "PATTERN_994": 1089,
    "PATTERN_995": 1090,
    "PATTERN_996": 1091,
    "PATTERN_997": 1092,
    "PATTERN_998": 1093,
    "PATTERN_999": 1094,
    "PATTERN_1000": 1095,
    "PATTERN_1001": 1096,
    "PATTERN_1002": 1097,
    "PATTERN_1003": 1098,
    "PATTERN_1004": 1099,
    "PATTERN_1005": 1100,
    "PATTERN_1006": 1101,
    "PATTERN_1007": 1102,
    "PATTERN_1008": 1103,
    "PATTERN_1009": 1104,
    "PATTERN_1010": 1105,
    "PATTERN_1011": 1106,
    "PATTERN_1012": 1107,
    "PATTERN_1013": 1108,
    "PATTERN_1014": 1109,
    "PATTERN_1015": 1110,
    "PATTERN_1016": 1111,
    "PATTERN_1017": 1112,
    "PATTERN_1018": 1113,
    "PATTERN_1019": 1114,
    "PATTERN_1020": 1115,
    "PATTERN_1021": 1116,
    "PATTERN_1022": 1117,
    "PATTERN_1023": 1118,
    "PATTERN_1024": 1119,
    "PATTERN_1025": 1120,
    "PATTERN_1026": 1121,
    "PATTERN_1027": 1122,
    "PATTERN_1028": 1123,
    "PATTERN_1029": 1124,
    "PATTERN_1030": 1125,
    "PATTERN_1031": 1126,
    "PATTERN_1032": 1127,
    "PATTERN_1033": 1128,
    "PATTERN_1034": 1129,
    "PATTERN_1035": 1130,
    "PATTERN_1036": 1131,
    "PATTERN_1037": 1132,
    "PATTERN_1038": 1133,
    "PATTERN_1039": 1134,
    "PATTERN_1040": 1135,
    "PATTERN_1041": 1136,
    "PATTERN_1042": 1137,
    "PATTERN_1043": 1138,
    "PATTERN_1044": 1139,
    "PATTERN_1045": 1140,
    "PATTERN_1046": 1141,
    "PATTERN_1047": 1142,
    "PATTERN_1048": 1143,
    "PATTERN_1049": 1144,
    "PATTERN_1050": 1145,
    "PATTERN_1051": 1146,
    "PATTERN_1052": 1147,
    "PATTERN_1053": 1148,
    "PATTERN_1054": 1149,
    "PATTERN_1055": 1150,
    "PATTERN_1056": 1151,
    "PATTERN_1057": 1152,
    "PATTERN_1058": 1153,
    "PATTERN_1059": 1154,
    "PATTERN_1060": 1155,
    "PATTERN_1061": 1156,
    "PATTERN_1062": 1157,
    "PATTERN_1063": 1158,
    "PATTERN_1064": 1159,
    "PATTERN_1065": 1160,
    "PATTERN_1066": 1161,
    "PATTERN_1067": 1162,
    "PATTERN_1068": 1163,
    "PATTERN_1069": 1164,
    "PATTERN_1070": 1165,
    "PATTERN_1071": 1166,
    "PATTERN_1072": 1167,
    "PATTERN_1073": 1168,
    "PATTERN_1074": 1169,
    "PATTERN_1075": 1170,
    "PATTERN_1076": 1171,
    "PATTERN_1077": 1172,
    "PATTERN_1078": 1173,
    "PATTERN_1079": 1174,
    "PATTERN_1080": 1175,
    "PATTERN_1081": 1176,
    "PATTERN_1082": 1177,
    "PATTERN_1083": 1178,
    "PATTERN_1084": 1179,
    "PATTERN_1085": 1180,
    "PATTERN_1086": 1181,
    "PATTERN_1087": 1182,
    "PATTERN_1088": 1183,
    "PATTERN_1089": 1184,
    "PATTERN_1090": 1185,
    "PATTERN_1091": 1186,
    "PATTERN_1092": 1187,
    "PATTERN_1093": 1188,
    "PATTERN_1094": 1189,
    "PATTERN_1095": 1190,
    "PATTERN_1096": 1191,
    "PATTERN_1097": 1192,
    "PATTERN_1098": 1193,
    "PATTERN_1099": 1194,
    "PATTERN_1100": 1195,
    "PATTERN_1101": 1196,
    "PATTERN_1102": 1197,
    "PATTERN_1103": 1198,
    "PATTERN_1104": 1199,
    "PATTERN_1105": 1200,
    "PATTERN_1106": 1201,
    "PATTERN_1107": 1202,
    "PATTERN_1108": 1203,
    "PATTERN_1109": 1204,
    "PATTERN_1110": 1205,
    "PATTERN_1111": 1206,
    "PATTERN_1112": 1207,
    "PATTERN_1113": 1208,
    "PATTERN_1114": 1209,
    "PATTERN_1115": 1210,
    "PATTERN_1116": 1211,
    "PATTERN_1117": 1212,
    "PATTERN_1118": 1213,
    "PATTERN_1119": 1214,
    "PATTERN_1120": 1215,
    "PATTERN_1121": 1216,
    "PATTERN_1122": 1217,
    "PATTERN_1123": 1218,
    "PATTERN_1124": 1219,
    "PATTERN_1125": 1220,
    "PATTERN_1126": 1221,
    "PATTERN_1127": 1222,
    "PATTERN_1128": 1223,
    "PATTERN_1129": 1224,
    "PATTERN_1130": 1225,
    "PATTERN_1131": 1226,
    "PATTERN_1132": 1227,
    "PATTERN_1133": 1228,
    "PATTERN_1134": 1229,
    "PATTERN_1135": 1230,
    "PATTERN_1136": 1231,
    "PATTERN_1137": 1232,
    "PATTERN_1138": 1233,
    "PATTERN_1139": 1234,
    "PATTERN_1140": 1235,
    "PATTERN_1141": 1236,
    "PATTERN_1142": 1237,
    "PATTERN_1143": 1238,
    "PATTERN_1144": 1239,
    "PATTERN_1145": 1240,
    "PATTERN_1146": 1241,
    "PATTERN_1147": 1242,
    "PATTERN_1148": 1243,
    "PATTERN_1149": 1244,
    "PATTERN_1150": 1245,
    "PATTERN_1151": 1246,
    "PATTERN_1152": 1247,
    "PATTERN_1153": 1248,
    "PATTERN_1154": 1249,
    "PATTERN_1155": 1250,
    "PATTERN_1156": 1251,
    "PATTERN_1157": 1252,
    "PATTERN_1158": 1253,
    "PATTERN_1159": 1254,
    "PATTERN_1160": 1255,
    "PATTERN_1161": 1256,
    "PATTERN_1162": 1257,
    "PATTERN_1163": 1258,
    "PATTERN_1164": 1259,
    "PATTERN_1165": 1260,
    "PATTERN_1166": 1261,
    "PATTERN_1167": 1262,
    "PATTERN_1168": 1263,
    "PATTERN_1169": 1264,
    "PATTERN_1170": 1265,
    "PATTERN_1171": 1266,
    "PATTERN_1172": 1267,
    "PATTERN_1173": 1268,
    "PATTERN_1174": 1269,
    "PATTERN_1175": 1270,
    "PATTERN_1176": 1271,
    "PATTERN_1177": 1272,
    "PATTERN_1178": 1273,
    "PATTERN_1179": 1274,
    "PATTERN_1180": 1275,
    "PATTERN_1181": 1276,
    "PATTERN_1182": 1277,
    "PATTERN_1183": 1278,
    "PATTERN_1184": 1279,
    "PATTERN_1185": 1280,
    "PATTERN_1186": 1281,
    "PATTERN_1187": 1282,
    "PATTERN_1188": 1283,
    "PATTERN_1189": 1284,
    "PATTERN_1190": 1285,
    "PATTERN_1191": 1286,
    "PATTERN_1192": 1287,
    "PATTERN_1193": 1288,
    "PATTERN_1194": 1289,
    "PATTERN_1195": 1290,
    "PATTERN_1196": 1291,
    "PATTERN_1197": 1292,
    "PATTERN_1198": 1293,
    "PATTERN_1199": 1294,
    "PATTERN_1200": 1295,
    "PATTERN_1201": 1296,
    "PATTERN_1202": 1297,
    "PATTERN_1203": 1298,
    "PATTERN_1204": 1299,
    "PATTERN_1205": 1300,
    "PATTERN_1206": 1301,
    "PATTERN_1207": 1302,
    "PATTERN_1208": 1303,
    "PATTERN_1209": 1304,
    "PATTERN_1210": 1305,
    "PATTERN_1211": 1306,
    "PATTERN_1212": 1307,
    "PATTERN_1213": 1308,
    "PATTERN_1214": 1309,
    "PATTERN_1215": 1310,
    "PATTERN_1216": 1311,
    "PATTERN_1217": 1312,
    "PATTERN_1218": 1313,
    "PATTERN_1219": 1314,
    "PATTERN_1220": 1315,
    "PATTERN_1221": 1316,
    "PATTERN_1222": 1317,
    "PATTERN_1223": 1318,
    "PATTERN_1224": 1319,
    "PATTERN_1225": 1320,
    "PATTERN_1226": 1321,
    "PATTERN_1227": 1322,
    "PATTERN_1228": 1323,
    "PATTERN_1229": 1324,
    "PATTERN_1230": 1325,
    "PATTERN_1231": 1326,
    "PATTERN_1232": 1327,
    "PATTERN_1233": 1328,
    "PATTERN_1234": 1329,
    "PATTERN_1235": 1330,
    "PATTERN_1236": 1331,
    "PATTERN_1237": 1332,
    "PATTERN_1238": 1333,
    "PATTERN_1239": 1334,
    "PATTERN_1240": 1335,
    "PATTERN_1241": 1336,
    "PATTERN_1242": 1337,
    "PATTERN_1243": 1338,
    "PATTERN_1244": 1339,
    "PATTERN_1245": 1340,
    "PATTERN_1246": 1341,
    "PATTERN_1247": 1342,
    "PATTERN_1248": 1343,
    "PATTERN_1249": 1344,
    "PATTERN_1250": 1345,
    "PATTERN_1251": 1346,
    "PATTERN_1252": 1347,
    "PATTERN_1253": 1348,
    "PATTERN_1254": 1349,
    "PATTERN_1255": 1350,
    "PATTERN_1256": 1351,
    "PATTERN_1257": 1352,
    "PATTERN_1258": 1353,
    "PATTERN_1259": 1354,
    "PATTERN_1260": 1355,
    "PATTERN_1261": 1356,
    "PATTERN_1262": 1357,
    "PATTERN_1263": 1358,
    "PATTERN_1264": 1359,
    "PATTERN_1265": 1360,
    "PATTERN_1266": 1361,
    "PATTERN_1267": 1362,
    "PATTERN_1268": 1363,
    "PATTERN_1269": 1364,
    "PATTERN_1270": 1365,
    "PATTERN_1271": 1366,
    "PATTERN_1272": 1367,
    "PATTERN_1273": 1368,
    "PATTERN_1274": 1369,
    "PATTERN_1275": 1370,
    "PATTERN_1276": 1371,
    "PATTERN_1277": 1372,
    "PATTERN_1278": 1373,
    "PATTERN_1279": 1374,
    "PATTERN_1280": 1375,
    "PATTERN_1281": 1376,
    "PATTERN_1282": 1377,
    "PATTERN_1283": 1378,
    "PATTERN_1284": 1379,
    "PATTERN_1285": 1380,
    "PATTERN_1286": 1381,
    "PATTERN_1287": 1382,
    "PATTERN_1288": 1383,
    "PATTERN_1289": 1384,
    "PATTERN_1290": 1385,
    "PATTERN_1291": 1386,
    "PATTERN_1292": 1387,
    "PATTERN_1293": 1388,
    "PATTERN_1294": 1389,
    "PATTERN_1295": 1390,
    "PATTERN_1296": 1391,
    "PATTERN_1297": 1392,
    "PATTERN_1298": 1393,
    "PATTERN_1299": 1394,
    "PATTERN_1300": 1395,
    "PATTERN_1301": 1396,
    "PATTERN_1302": 1397,
    "PATTERN_1303": 1398,
    "PATTERN_1304": 1399,
    "PATTERN_1305": 1400,
    "PATTERN_1306": 1401,
    "PATTERN_1307": 1402,
    "PATTERN_1308": 1403,
    "PATTERN_1309": 1404,
    "PATTERN_1310": 1405,
    "PATTERN_1311": 1406,
    "PATTERN_1312": 1407,
    "PATTERN_1313": 1408,
    "PATTERN_1314": 1409,
    "PATTERN_1315": 1410,
    "PATTERN_1316": 1411,
    "PATTERN_1317": 1412,
    "PATTERN_1318": 1413,
    "PATTERN_1319": 1414,
    "PATTERN_1320": 1415,
    "PATTERN_1321": 1416,
    "PATTERN_1322": 1417,
    "PATTERN_1323": 1418,
    "PATTERN_1324": 1419,
    "PATTERN_1325": 1420,
    "PATTERN_1326": 1421,
    "PATTERN_1327": 1422,
    "PATTERN_1328": 1423,
    "PATTERN_1329": 1424,
    "PATTERN_1330": 1425,
    "PATTERN_1331": 1426,
    "PATTERN_1332": 1427,
    "PATTERN_1333": 1428,
    "PATTERN_1334": 1429,
    "PATTERN_1335": 1430,
    "PATTERN_1336": 1431,
    "PATTERN_1337": 1432,
    "PATTERN_1338": 1433,
    "PATTERN_1339": 1434,
    "PATTERN_1340": 1435,
    "PATTERN_1341": 1436,
    "PATTERN_1342": 1437,
    "PATTERN_1343": 1438,
    "PATTERN_1344": 1439,
    "PATTERN_1345": 1440,
    "PATTERN_1346": 1441,
    "PATTERN_1347": 1442,
    "PATTERN_1348": 1443,
    "PATTERN_1349": 1444,
    "PATTERN_1350": 1445,
    "PATTERN_1351": 1446,
    "PATTERN_1352": 1447,
    "PATTERN_1353": 1448,
    "PATTERN_1354": 1449,
    "PATTERN_1355": 1450,
    "PATTERN_1356": 1451,
    "PATTERN_1357": 1452,
    "PATTERN_1358": 1453,
    "PATTERN_1359": 1454,
    "PATTERN_1360": 1455,
    "PATTERN_1361": 1456,
    "PATTERN_1362": 1457,
    "PATTERN_1363": 1458,
    "PATTERN_1364": 1459,
    "PATTERN_1365": 1460,
    "PATTERN_1366": 1461,
    "PATTERN_1367": 1462,
    "PATTERN_1368": 1463,
    "PATTERN_1369": 1464,
    "PATTERN_1370": 1465,
    "PATTERN_1371": 1466,
    "PATTERN_1372": 1467,
    "PATTERN_1373": 1468,
    "PATTERN_1374": 1469,
    "PATTERN_1375": 1470,
    "PATTERN_1376": 1471,
    "PATTERN_1377": 1472,
    "PATTERN_1378": 1473,
    "PATTERN_1379": 1474,
    "PATTERN_1380": 1475,
    "PATTERN_1381": 1476,
    "PATTERN_1382": 1477,
    "PATTERN_1383": 1478,
    "PATTERN_1384": 1479,
    "PATTERN_1385": 1480,
    "PATTERN_1386": 1481,
    "PATTERN_1387": 1482,
    "PATTERN_1388": 1483,
    "PATTERN_1389": 1484,
    "PATTERN_1390": 1485,
    "PATTERN_1391": 1486,
    "PATTERN_1392": 1487,
    "PATTERN_1393": 1488,
    "PATTERN_1394": 1489,
    "PATTERN_1395": 1490,
    "PATTERN_1396": 1491,
    "PATTERN_1397": 1492,
    "PATTERN_1398": 1493,
    "PATTERN_1399": 1494,
    "PATTERN_1400": 1495,
    "PATTERN_1401": 1496,
    "PATTERN_1402": 1497,
    "PATTERN_1403": 1498,
    "PATTERN_1404": 1499,
    "PATTERN_1405": 1500,
    "PATTERN_1406": 1501,
    "PATTERN_1407": 1502,
    "PATTERN_1408": 1503,
    "PATTERN_1409": 1504,
    "PATTERN_1410": 1505,
    "PATTERN_1411": 1506,
    "PATTERN_1412": 1507,
    "PATTERN_1413": 1508,
    "PATTERN_1414": 1509,
    "PATTERN_1415": 1510,
    "PATTERN_1416": 1511,
    "PATTERN_1417": 1512,
    "PATTERN_1418": 1513,
    "PATTERN_1419": 1514,
    "PATTERN_1420": 1515,
    "PATTERN_1421": 1516,
    "PATTERN_1422": 1517,
    "PATTERN_1423": 1518,
    "PATTERN_1424": 1519,
    "PATTERN_1425": 1520,
    "PATTERN_1426": 1521,
    "PATTERN_1427": 1522,
    "PATTERN_1428": 1523,
    "PATTERN_1429": 1524,
    "PATTERN_1430": 1525,
    "PATTERN_1431": 1526,
    "PATTERN_1432": 1527,
    "PATTERN_1433": 1528,
    "PATTERN_1434": 1529,
    "PATTERN_1435": 1530,
    "PATTERN_1436": 1531,
    "PATTERN_1437": 1532,
    "PATTERN_1438": 1533,
    "PATTERN_1439": 1534,
    "PATTERN_1440": 1535,
    "PATTERN_1441": 1536,
    "PATTERN_1442": 1537,
    "PATTERN_1443": 1538,
    "PATTERN_1444": 1539,
    "PATTERN_1445": 1540,
    "PATTERN_1446": 1541,
    "PATTERN_1447": 1542,
    "PATTERN_1448": 1543,
    "PATTERN_1449": 1544,
    "PATTERN_1450": 1545,
    "PATTERN_1451": 1546,
    "PATTERN_1452": 1547,
    "PATTERN_1453": 1548,
    "PATTERN_1454": 1549,
    "PATTERN_1455": 1550,
    "PATTERN_1456": 1551,
    "PATTERN_1457": 1552,
    "PATTERN_1458": 1553,
    "PATTERN_1459": 1554,
    "PATTERN_1460": 1555,
    "PATTERN_1461": 1556,
    "PATTERN_1462": 1557,
    "PATTERN_1463": 1558,
    "PATTERN_1464": 1559,
    "PATTERN_1465": 1560,
    "PATTERN_1466": 1561,
    "PATTERN_1467": 1562,
    "PATTERN_1468": 1563,
    "PATTERN_1469": 1564,
    "PATTERN_1470": 1565,
    "PATTERN_1471": 1566,
    "PATTERN_1472": 1567,
    "PATTERN_1473": 1568,
    "PATTERN_1474": 1569,
    "PATTERN_1475": 1570,
    "PATTERN_1476": 1571,
    "PATTERN_1477": 1572,
    "PATTERN_1478": 1573,
    "PATTERN_1479": 1574,
    "PATTERN_1480": 1575,
    "PATTERN_1481": 1576,
    "PATTERN_1482": 1577,
    "PATTERN_1483": 1578,
    "PATTERN_1484": 1579,
    "PATTERN_1485": 1580,
    "PATTERN_1486": 1581,
    "PATTERN_1487": 1582,
    "PATTERN_1488": 1583,
    "PATTERN_1489": 1584,
    "PATTERN_1490": 1585,
    "PATTERN_1491": 1586,
    "PATTERN_1492": 1587,
    "PATTERN_1493": 1588,
    "PATTERN_1494": 1589,
    "PATTERN_1495": 1590,
    "PATTERN_1496": 1591,
    "PATTERN_1497": 1592,
    "PATTERN_1498": 1593,
    "PATTERN_1499": 1594,
    "PATTERN_1500": 1595,
    "PATTERN_1501": 1596,
    "PATTERN_1502": 1597,
    "PATTERN_1503": 1598,
    "PATTERN_1504": 1599,
    "PATTERN_1505": 1600,
    "PATTERN_1506": 1601,
    "PATTERN_1507": 1602,
    "PATTERN_1508": 1603,
    "PATTERN_1509": 1604,
    "PATTERN_1510": 1605,
    "PATTERN_1511": 1606,
    "PATTERN_1512": 1607,
    "PATTERN_1513": 1608,
    "PATTERN_1514": 1609,
    "PATTERN_1515": 1610,
    "PATTERN_1516": 1611,
    "PATTERN_1517": 1612,
    "PATTERN_1518": 1613,
    "PATTERN_1519": 1614,
    "PATTERN_1520": 1615,
    "PATTERN_1521": 1616,
    "PATTERN_1522": 1617,
    "PATTERN_1523": 1618,
    "PATTERN_1524": 1619,
    "PATTERN_1525": 1620,
    "PATTERN_1526": 1621,
    "PATTERN_1527": 1622,
    "PATTERN_1528": 1623,
    "PATTERN_1529": 1624,
    "PATTERN_1530": 1625,
    "PATTERN_1531": 1626,
    "PATTERN_1532": 1627,
    "PATTERN_1533": 1628,
    "PATTERN_1534": 1629,
    "PATTERN_1535": 1630,
    "PATTERN_1536": 1631,
    "PATTERN_1537": 1632,
    "PATTERN_1538": 1633,
    "PATTERN_1539": 1634,
    "PATTERN_1540": 1635,
    "PATTERN_1541": 1636,
    "PATTERN_1542": 1637,
    "PATTERN_1543": 1638,
    "PATTERN_1544": 1639,
    "PATTERN_1545": 1640,
    "PATTERN_1546": 1641,
    "PATTERN_1547": 1642,
    "PATTERN_1548": 1643,
    "PATTERN_1549": 1644,
    "PATTERN_1550": 1645,
    "PATTERN_1551": 1646,
    "PATTERN_1552": 1647,
    "PATTERN_1553": 1648,
    "PATTERN_1554": 1649,
    "PATTERN_1555": 1650,
    "PATTERN_1556": 1651,
    "PATTERN_1557": 1652,
    "PATTERN_1558": 1653,
    "PATTERN_1559": 1654,
    "PATTERN_1560": 1655,
    "PATTERN_1561": 1656,
    "PATTERN_1562": 1657,
    "PATTERN_1563": 1658,
    "PATTERN_1564": 1659,
    "PATTERN_1565": 1660,
    "PATTERN_1566": 1661,
    "PATTERN_1567": 1662,
    "PATTERN_1568": 1663,
    "PATTERN_1569": 1664,
    "PATTERN_1570": 1665,
    "PATTERN_1571": 1666,
    "PATTERN_1572": 1667,
    "PATTERN_1573": 1668,
    "PATTERN_1574": 1669,
    "PATTERN_1575": 1670,
    "PATTERN_1576": 1671,
    "PATTERN_1577": 1672,
    "PATTERN_1578": 1673,
    "PATTERN_1579": 1674,
    "PATTERN_1580": 1675,
    "PATTERN_1581": 1676,
    "PATTERN_1582": 1677,
    "PATTERN_1583": 1678,
    "PATTERN_1584": 1679,
    "PATTERN_1585": 1680,
    "PATTERN_1586": 1681,
    "PATTERN_1587": 1682,
    "PATTERN_1588": 1683,
    "PATTERN_1589": 1684,
    "PATTERN_1590": 1685,
    "PATTERN_1591": 1686,
    "PATTERN_1592": 1687,
    "PATTERN_1593": 1688,
    "PATTERN_1594": 1689,
    "PATTERN_1595": 1690,
    "PATTERN_1596": 1691,
    "PATTERN_1597": 1692,
    "PATTERN_1598": 1693,
    "PATTERN_1599": 1694,
    "PATTERN_1600": 1695,
    "PATTERN_1601": 1696,
    "PATTERN_1602": 1697,
    "PATTERN_1603": 1698,
    "PATTERN_1604": 1699,
    "PATTERN_1605": 1700,
    "PATTERN_1606": 1701,
    "PATTERN_1607": 1702,
    "PATTERN_1608": 1703,
    "PATTERN_1609": 1704,
    "PATTERN_1610": 1705,
    "PATTERN_1611": 1706,
    "PATTERN_1612": 1707,
    "PATTERN_1613": 1708,
    "PATTERN_1614": 1709,
    "PATTERN_1615": 1710,
    "PATTERN_1616": 1711,
    "PATTERN_1617": 1712,
    "PATTERN_1618": 1713,
    "PATTERN_1619": 1714,
    "PATTERN_1620": 1715,
    "PATTERN_1621": 1716,
    "PATTERN_1622": 1717,
    "PATTERN_1623": 1718,
    "PATTERN_1624": 1719,
    "PATTERN_1625": 1720,
    "PATTERN_1626": 1721,
    "PATTERN_1627": 1722,
    "PATTERN_1628": 1723,
    "PATTERN_1629": 1724,
    "PATTERN_1630": 1725,
    "PATTERN_1631": 1726,
    "PATTERN_1632": 1727,
    "PATTERN_1633": 1728,
    "PATTERN_1634": 1729,
    "PATTERN_1635": 1730,
    "PATTERN_1636": 1731,
    "PATTERN_1637": 1732,
    "PATTERN_1638": 1733,
    "PATTERN_1639": 1734,
    "PATTERN_1640": 1735,
    "PATTERN_1641": 1736,
    "PATTERN_1642": 1737,
    "PATTERN_1643": 1738,
    "PATTERN_1644": 1739,
    "PATTERN_1645": 1740,
    "PATTERN_1646": 1741,
    "PATTERN_1647": 1742,
    "PATTERN_1648": 1743,
    "PATTERN_1649": 1744,
    "PATTERN_1650": 1745,
    "PATTERN_1651": 1746,
    "PATTERN_1652": 1747,
    "PATTERN_1653": 1748,
    "PATTERN_1654": 1749,
    "PATTERN_1655": 1750,
    "PATTERN_1656": 1751,
    "PATTERN_1657": 1752,
    "PATTERN_1658": 1753,
    "PATTERN_1659": 1754,
    "PATTERN_1660": 1755,
    "PATTERN_1661": 1756,
    "PATTERN_1662": 1757,
    "PATTERN_1663": 1758,
    "PATTERN_1664": 1759,
    "PATTERN_1665": 1760,
    "PATTERN_1666": 1761,
    "PATTERN_1667": 1762,
    "PATTERN_1668": 1763,
    "PATTERN_1669": 1764,
    "PATTERN_1670": 1765,
    "PATTERN_1671": 1766,
    "PATTERN_1672": 1767,
    "PATTERN_1673": 1768,
    "PATTERN_1674": 1769,
    "PATTERN_1675": 1770,
    "PATTERN_1676": 1771,
    "PATTERN_1677": 1772,
    "PATTERN_1678": 1773,
    "PATTERN_1679": 1774,
    "PATTERN_1680": 1775,
    "PATTERN_1681": 1776,
    "PATTERN_1682": 1777,
    "PATTERN_1683": 1778,
    "PATTERN_1684": 1779,
    "PATTERN_1685": 1780,
    "PATTERN_1686": 1781,
    "PATTERN_1687": 1782,
    "PATTERN_1688": 1783,
    "PATTERN_1689": 1784,
    "PATTERN_1690": 1785,
    "PATTERN_1691": 1786,
    "PATTERN_1692": 1787,
    "PATTERN_1693": 1788,
    "PATTERN_1694": 1789,
    "PATTERN_1695": 1790,
    "PATTERN_1696": 1791,
    "PATTERN_1697": 1792,
    "PATTERN_1698": 1793,
    "PATTERN_1699": 1794,
    "PATTERN_1700": 1795,
    "PATTERN_1701": 1796,
    "PATTERN_1702": 1797,
    "PATTERN_1703": 1798,
    "PATTERN_1704": 1799,
    "PATTERN_1705": 1800,
    "PATTERN_1706": 1801,
    "PATTERN_1707": 1802,
    "PATTERN_1708": 1803,
    "PATTERN_1709": 1804,
    "PATTERN_1710": 1805,
    "PATTERN_1711": 1806,
    "PATTERN_1712": 1807,
    "PATTERN_1713": 1808,
    "PATTERN_1714": 1809,
    "PATTERN_1715": 1810,
    "PATTERN_1716": 1811,
    "PATTERN_1717": 1812,
    "PATTERN_1718": 1813,
    "PATTERN_1719": 1814,
    "PATTERN_1720": 1815,
    "PATTERN_1721": 1816,
    "PATTERN_1722": 1817,
    "PATTERN_1723": 1818,
    "PATTERN_1724": 1819,
    "PATTERN_1725": 1820,
    "PATTERN_1726": 1821,
    "PATTERN_1727": 1822,
    "PATTERN_1728": 1823,
    "PATTERN_1729": 1824,
    "PATTERN_1730": 1825,
    "PATTERN_1731": 1826,
    "PATTERN_1732": 1827,
    "PATTERN_1733": 1828,
    "PATTERN_1734": 1829,
    "PATTERN_1735": 1830,
    "PATTERN_1736": 1831,
    "PATTERN_1737": 1832,
    "PATTERN_1738": 1833,
    "PATTERN_1739": 1834,
    "PATTERN_1740": 1835,
    "PATTERN_1741": 1836,
    "PATTERN_1742": 1837,
    "PATTERN_1743": 1838,
    "PATTERN_1744": 1839,
    "PATTERN_1745": 1840,
    "PATTERN_1746": 1841,
    "PATTERN_1747": 1842,
    "PATTERN_1748": 1843,
    "PATTERN_1749": 1844,
    "PATTERN_1750": 1845,
    "PATTERN_1751": 1846,
    "PATTERN_1752": 1847,
    "PATTERN_1753": 1848,
    "PATTERN_1754": 1849,
    "PATTERN_1755": 1850,
    "PATTERN_1756": 1851,
    "PATTERN_1757": 1852,
    "PATTERN_1758": 1853,
    "PATTERN_1759": 1854,
    "PATTERN_1760": 1855,
    "PATTERN_1761": 1856,
    "PATTERN_1762": 1857,
    "PATTERN_1763": 1858,
    "PATTERN_1764": 1859,
    "PATTERN_1765": 1860,
    "PATTERN_1766": 1861,
    "PATTERN_1767": 1862,
    "PATTERN_1768": 1863,
    "PATTERN_1769": 1864,
    "PATTERN_1770": 1865,
    "PATTERN_1771": 1866,
    "PATTERN_1772": 1867,
    "PATTERN_1773": 1868,
    "PATTERN_1774": 1869,
    "PATTERN_1775": 1870,
    "PATTERN_1776": 1871,
    "PATTERN_1777": 1872,
    "PATTERN_1778": 1873,
    "PATTERN_1779": 1874,
    "PATTERN_1780": 1875,
    "PATTERN_1781": 1876,
    "PATTERN_1782": 1877,
    "PATTERN_1783": 1878,
    "PATTERN_1784": 1879,
    "PATTERN_1785": 1880,
    "PATTERN_1786": 1881,
    "PATTERN_1787": 1882,
    "PATTERN_1788": 1883,
    "PATTERN_1789": 1884,
    "PATTERN_1790": 1885,
    "PATTERN_1791": 1886,
    "PATTERN_1792": 1887,
    "PATTERN_1793": 1888,
    "PATTERN_1794": 1889,
    "PATTERN_1795": 1890,
    "PATTERN_1796": 1891,
    "PATTERN_1797": 1892,
    "PATTERN_1798": 1893,
    "PATTERN_1799": 1894,
    "PATTERN_1800": 1895,
    "PATTERN_1801": 1896,
    "PATTERN_1802": 1897,
    "PATTERN_1803": 1898,
    "PATTERN_1804": 1899,
    "PATTERN_1805": 1900,
    "PATTERN_1806": 1901,
    "PATTERN_1807": 1902,
    "PATTERN_1808": 1903,
    "PATTERN_1809": 1904,
    "PATTERN_1810": 1905,
    "PATTERN_1811": 1906,
    "PATTERN_1812": 1907,
    "PATTERN_1813": 1908,
    "PATTERN_1814": 1909,
    "PATTERN_1815": 1910,
    "PATTERN_1816": 1911,
    "PATTERN_1817": 1912,
    "PATTERN_1818": 1913,
    "PATTERN_1819": 1914,
    "PATTERN_1820": 1915,
    "PATTERN_1821": 1916,
    "PATTERN_1822": 1917,
    "PATTERN_1823": 1918,
    "PATTERN_1824": 1919,
    "PATTERN_1825": 1920,
    "PATTERN_1826": 1921,
    "PATTERN_1827": 1922,
    "PATTERN_1828": 1923,
    "PATTERN_1829": 1924,
    "PATTERN_1830": 1925,
    "PATTERN_1831": 1926,
    "PATTERN_1832": 1927,
    "PATTERN_1833": 1928,
    "PATTERN_1834": 1929,
    "PATTERN_1835": 1930,
    "PATTERN_1836": 1931,
    "PATTERN_1837": 1932,
    "PATTERN_1838": 1933,
    "PATTERN_1839": 1934,
    "PATTERN_1840": 1935,
    "PATTERN_1841": 1936,
    "PATTERN_1842": 1937,
    "PATTERN_1843": 1938,
    "PATTERN_1844": 1939,
    "PATTERN_1845": 1940,
    "PATTERN_1846": 1941,
    "PATTERN_1847": 1942,
    "PATTERN_1848": 1943,
    "PATTERN_1849": 1944,
    "PATTERN_1850": 1945,
    "PATTERN_1851": 1946,
    "PATTERN_1852": 1947,
    "PATTERN_1853": 1948,
    "PATTERN_1854": 1949,
    "PATTERN_1855": 1950,
    "PATTERN_1856": 1951,
    "PATTERN_1857": 1952,
    "PATTERN_1858": 1953,
    "PATTERN_1859": 1954,
    "PATTERN_1860": 1955,
    "PATTERN_1861": 1956,
    "PATTERN_1862": 1957,
    "PATTERN_1863": 1958,
    "PATTERN_1864": 1959,
    "PATTERN_1865": 1960,
    "PATTERN_1866": 1961,
    "PATTERN_1867": 1962,
    "PATTERN_1868": 1963,
    "PATTERN_1869": 1964,
    "PATTERN_1870": 1965,
    "PATTERN_1871": 1966,
    "PATTERN_1872": 1967,
    "PATTERN_1873": 1968,
    "PATTERN_1874": 1969,
    "PATTERN_1875": 1970,
    "PATTERN_1876": 1971,
    "PATTERN_1877": 1972,
    "PATTERN_1878": 1973,
    "PATTERN_1879": 1974,
    "PATTERN_1880": 1975,
    "PATTERN_1881": 1976,
    "PATTERN_1882": 1977,
    "PATTERN_1883": 1978,
    "PATTERN_1884": 1979,
    "PATTERN_1885": 1980,
    "PATTERN_1886": 1981,
    "PATTERN_1887": 1982,
    "PATTERN_1888": 1983,
    "PATTERN_1889": 1984,
    "PATTERN_1890": 1985,
    "PATTERN_1891": 1986,
    "PATTERN_1892": 1987,
    "PATTERN_1893": 1988,
    "PATTERN_1894": 1989,
    "PATTERN_1895": 1990,
    "PATTERN_1896": 1991,
    "PATTERN_1897": 1992,
    "PATTERN_1898": 1993,
    "PATTERN_1899": 1994,
    "PATTERN_1900": 1995,
    "PATTERN_1901": 1996,
    "PATTERN_1902": 1997,
    "PATTERN_1903": 1998,
    "PATTERN_1904": 1999,
    "PATTERN_1905": 2000,
    "PATTERN_1906": 2001,
    "PATTERN_1907": 2002,
    "PATTERN_1908": 2003,
    "PATTERN_1909": 2004,
    "PATTERN_1910": 2005,
    "PATTERN_1911": 2006,
    "PATTERN_1912": 2007,
    "PATTERN_1913": 2008,
    "PATTERN_1914": 2009,
    "PATTERN_1915": 2010,
    "PATTERN_1916": 2011,
    "PATTERN_1917": 2012,
    "PATTERN_1918": 2013,
    "PATTERN_1919": 2014,
    "PATTERN_1920": 2015,
    "PATTERN_1921": 2016,
    "PATTERN_1922": 2017,
    "PATTERN_1923": 2018,
    "PATTERN_1924": 2019,
    "PATTERN_1925": 2020,
    "PATTERN_1926": 2021,
    "PATTERN_1927": 2022,
    "PATTERN_1928": 2023,
    "PATTERN_1929": 2024,
    "PATTERN_1930": 2025,
