program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3304.5.2"}, {"coremlc-version", "3304.6.2"}, {"coremltools-component-torch", "2.8.0+cu128"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios16>(tensor<fp16, [1, 2, ?]> audio_in) [FlexibleShapeInformation = tuple<tuple<tensor<string, []>, dict<tensor<string, []>, tensor<int32, [?]>>>, tuple<tensor<string, []>, dict<tensor<string, []>, list<tensor<int32, [2]>, ?>>>>((("DefaultShapes", {{"audio_in", [1, 2, 44100]}}), ("RangeDims", {{"audio_in", [[1, 1], [2, 2], [1024, 441000]]}})))] {
            tensor<string, []> input_1_pad_type_0 = const()[name = tensor<string, []>("input_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_1_pad_0 = const()[name = tensor<string, []>("input_1_pad_0"), val = tensor<int32, [2]>([3, 3])];
            tensor<int32, [1]> input_1_strides_0 = const()[name = tensor<string, []>("input_1_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_1_dilations_0 = const()[name = tensor<string, []>("input_1_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_1_groups_0 = const()[name = tensor<string, []>("input_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 2, 7]> input_proj_weight_to_fp16 = const()[name = tensor<string, []>("input_proj_weight_to_fp16"), val = tensor<fp16, [64, 2, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [64]> input_proj_bias_to_fp16 = const()[name = tensor<string, []>("input_proj_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1920)))];
            tensor<fp16, [1, 64, ?]> input_1_cast_fp16 = conv(bias = input_proj_bias_to_fp16, dilations = input_1_dilations_0, groups = input_1_groups_0, pad = input_1_pad_0, pad_type = input_1_pad_type_0, strides = input_1_strides_0, weight = input_proj_weight_to_fp16, x = audio_in)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<string, []> input_3_pad_type_0 = const()[name = tensor<string, []>("input_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_3_pad_0 = const()[name = tensor<string, []>("input_3_pad_0"), val = tensor<int32, [2]>([3, 3])];
            tensor<int32, [1]> input_3_strides_0 = const()[name = tensor<string, []>("input_3_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_3_dilations_0 = const()[name = tensor<string, []>("input_3_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_3_groups_0 = const()[name = tensor<string, []>("input_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 7]> blocks_0_0_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_0_weight_to_fp16"), val = tensor<fp16, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2112)))];
            tensor<fp16, [64]> blocks_0_0_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_0_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(59520)))];
            tensor<fp16, [1, 64, ?]> input_3_cast_fp16 = conv(bias = blocks_0_0_bias_to_fp16, dilations = input_3_dilations_0, groups = input_3_groups_0, pad = input_3_pad_0, pad_type = input_3_pad_type_0, strides = input_3_strides_0, weight = blocks_0_0_weight_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<int32, [3]> shape_0_cast_fp16 = shape(x = input_3_cast_fp16)[name = tensor<string, []>("shape_0_cast_fp16")];
            tensor<int32, [4]> concat_0x = const()[name = tensor<string, []>("concat_0x"), val = tensor<int32, [4]>([1, 8, 8, -1])];
            tensor<fp16, [1, 8, 8, ?]> reshape_0_cast_fp16 = reshape(shape = concat_0x, x = input_3_cast_fp16)[name = tensor<string, []>("reshape_0_cast_fp16")];
            tensor<int32, [2]> reduce_mean_0_axes_0 = const()[name = tensor<string, []>("reduce_mean_0_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_0_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_0_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 8, 1, 1]> reduce_mean_0_cast_fp16 = reduce_mean(axes = reduce_mean_0_axes_0, keep_dims = reduce_mean_0_keep_dims_0, x = reshape_0_cast_fp16)[name = tensor<string, []>("reduce_mean_0_cast_fp16")];
            tensor<fp16, [1, 8, 8, ?]> sub_0_cast_fp16 = sub(x = reshape_0_cast_fp16, y = reduce_mean_0_cast_fp16)[name = tensor<string, []>("sub_0_cast_fp16")];
            tensor<fp16, [1, 8, 8, ?]> square_0_cast_fp16 = square(x = sub_0_cast_fp16)[name = tensor<string, []>("square_0_cast_fp16")];
            tensor<int32, [2]> reduce_mean_2_axes_0 = const()[name = tensor<string, []>("reduce_mean_2_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_2_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_2_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 8, 1, 1]> reduce_mean_2_cast_fp16 = reduce_mean(axes = reduce_mean_2_axes_0, keep_dims = reduce_mean_2_keep_dims_0, x = square_0_cast_fp16)[name = tensor<string, []>("reduce_mean_2_cast_fp16")];
            tensor<fp16, []> add_0_y_0_to_fp16 = const()[name = tensor<string, []>("add_0_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 8, 1, 1]> add_0_cast_fp16 = add(x = reduce_mean_2_cast_fp16, y = add_0_y_0_to_fp16)[name = tensor<string, []>("add_0_cast_fp16")];
            tensor<fp16, [1, 8, 1, 1]> sqrt_0_cast_fp16 = sqrt(x = add_0_cast_fp16)[name = tensor<string, []>("sqrt_0_cast_fp16")];
            tensor<fp16, [1, 8, 8, ?]> real_div_0_cast_fp16 = real_div(x = sub_0_cast_fp16, y = sqrt_0_cast_fp16)[name = tensor<string, []>("real_div_0_cast_fp16")];
            tensor<fp16, [1, 64, ?]> reshape_1_cast_fp16 = reshape(shape = shape_0_cast_fp16, x = real_div_0_cast_fp16)[name = tensor<string, []>("reshape_1_cast_fp16")];
            tensor<fp16, [1, 64, 1]> reshape_2_to_fp16 = const()[name = tensor<string, []>("reshape_2_to_fp16"), val = tensor<fp16, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(59712)))];
            tensor<fp16, [1, 64, ?]> mul_0_cast_fp16 = mul(x = reshape_1_cast_fp16, y = reshape_2_to_fp16)[name = tensor<string, []>("mul_0_cast_fp16")];
            tensor<fp16, [1, 64, 1]> reshape_3_to_fp16 = const()[name = tensor<string, []>("reshape_3_to_fp16"), val = tensor<fp16, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(59904)))];
            tensor<fp16, [1, 64, ?]> add_1_cast_fp16 = add(x = mul_0_cast_fp16, y = reshape_3_to_fp16)[name = tensor<string, []>("add_1_cast_fp16")];
            tensor<fp16, [1, 64, ?]> input_7_cast_fp16 = silu(x = add_1_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<string, []> input_9_pad_type_0 = const()[name = tensor<string, []>("input_9_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_9_pad_0 = const()[name = tensor<string, []>("input_9_pad_0"), val = tensor<int32, [2]>([3, 3])];
            tensor<int32, [1]> input_9_strides_0 = const()[name = tensor<string, []>("input_9_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_9_dilations_0 = const()[name = tensor<string, []>("input_9_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_9_groups_0 = const()[name = tensor<string, []>("input_9_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 7]> blocks_0_3_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_3_weight_to_fp16"), val = tensor<fp16, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(60096)))];
            tensor<fp16, [64]> blocks_0_3_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_3_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(117504)))];
            tensor<fp16, [1, 64, ?]> input_9_cast_fp16 = conv(bias = blocks_0_3_bias_to_fp16, dilations = input_9_dilations_0, groups = input_9_groups_0, pad = input_9_pad_0, pad_type = input_9_pad_type_0, strides = input_9_strides_0, weight = blocks_0_3_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<int32, [3]> shape_1_cast_fp16 = shape(x = input_9_cast_fp16)[name = tensor<string, []>("shape_1_cast_fp16")];
            tensor<int32, [4]> concat_1x = const()[name = tensor<string, []>("concat_1x"), val = tensor<int32, [4]>([1, 8, 8, -1])];
            tensor<fp16, [1, 8, 8, ?]> reshape_4_cast_fp16 = reshape(shape = concat_1x, x = input_9_cast_fp16)[name = tensor<string, []>("reshape_4_cast_fp16")];
            tensor<int32, [2]> reduce_mean_3_axes_0 = const()[name = tensor<string, []>("reduce_mean_3_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_3_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_3_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 8, 1, 1]> reduce_mean_3_cast_fp16 = reduce_mean(axes = reduce_mean_3_axes_0, keep_dims = reduce_mean_3_keep_dims_0, x = reshape_4_cast_fp16)[name = tensor<string, []>("reduce_mean_3_cast_fp16")];
            tensor<fp16, [1, 8, 8, ?]> sub_2_cast_fp16 = sub(x = reshape_4_cast_fp16, y = reduce_mean_3_cast_fp16)[name = tensor<string, []>("sub_2_cast_fp16")];
            tensor<fp16, [1, 8, 8, ?]> square_1_cast_fp16 = square(x = sub_2_cast_fp16)[name = tensor<string, []>("square_1_cast_fp16")];
            tensor<int32, [2]> reduce_mean_5_axes_0 = const()[name = tensor<string, []>("reduce_mean_5_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_5_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_5_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 8, 1, 1]> reduce_mean_5_cast_fp16 = reduce_mean(axes = reduce_mean_5_axes_0, keep_dims = reduce_mean_5_keep_dims_0, x = square_1_cast_fp16)[name = tensor<string, []>("reduce_mean_5_cast_fp16")];
            tensor<fp16, []> add_2_y_0_to_fp16 = const()[name = tensor<string, []>("add_2_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 8, 1, 1]> add_2_cast_fp16 = add(x = reduce_mean_5_cast_fp16, y = add_2_y_0_to_fp16)[name = tensor<string, []>("add_2_cast_fp16")];
            tensor<fp16, [1, 8, 1, 1]> sqrt_1_cast_fp16 = sqrt(x = add_2_cast_fp16)[name = tensor<string, []>("sqrt_1_cast_fp16")];
            tensor<fp16, [1, 8, 8, ?]> real_div_1_cast_fp16 = real_div(x = sub_2_cast_fp16, y = sqrt_1_cast_fp16)[name = tensor<string, []>("real_div_1_cast_fp16")];
            tensor<fp16, [1, 64, ?]> reshape_5_cast_fp16 = reshape(shape = shape_1_cast_fp16, x = real_div_1_cast_fp16)[name = tensor<string, []>("reshape_5_cast_fp16")];
            tensor<fp16, [1, 64, 1]> reshape_6_to_fp16 = const()[name = tensor<string, []>("reshape_6_to_fp16"), val = tensor<fp16, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(117696)))];
            tensor<fp16, [1, 64, ?]> mul_1_cast_fp16 = mul(x = reshape_5_cast_fp16, y = reshape_6_to_fp16)[name = tensor<string, []>("mul_1_cast_fp16")];
            tensor<fp16, [1, 64, 1]> reshape_7_to_fp16 = const()[name = tensor<string, []>("reshape_7_to_fp16"), val = tensor<fp16, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(117888)))];
            tensor<fp16, [1, 64, ?]> add_3_cast_fp16 = add(x = mul_1_cast_fp16, y = reshape_7_to_fp16)[name = tensor<string, []>("add_3_cast_fp16")];
            tensor<fp16, [1, 64, ?]> input_11_cast_fp16 = add(x = input_1_cast_fp16, y = add_3_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<string, []> input_13_pad_type_0 = const()[name = tensor<string, []>("input_13_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_13_pad_0 = const()[name = tensor<string, []>("input_13_pad_0"), val = tensor<int32, [2]>([6, 6])];
            tensor<int32, [1]> input_13_dilations_0 = const()[name = tensor<string, []>("input_13_dilations_0"), val = tensor<int32, [1]>([2])];
            tensor<int32, [1]> input_13_strides_0 = const()[name = tensor<string, []>("input_13_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_13_groups_0 = const()[name = tensor<string, []>("input_13_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 7]> blocks_1_0_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_0_weight_to_fp16"), val = tensor<fp16, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(118080)))];
            tensor<fp16, [64]> blocks_1_0_bias_to_fp16 = const()[name = tensor<string, []>("blocks_1_0_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(175488)))];
            tensor<fp16, [1, 64, ?]> input_13_cast_fp16 = conv(bias = blocks_1_0_bias_to_fp16, dilations = input_13_dilations_0, groups = input_13_groups_0, pad = input_13_pad_0, pad_type = input_13_pad_type_0, strides = input_13_strides_0, weight = blocks_1_0_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<int32, [3]> shape_2_cast_fp16 = shape(x = input_13_cast_fp16)[name = tensor<string, []>("shape_2_cast_fp16")];
            tensor<int32, [4]> concat_2x = const()[name = tensor<string, []>("concat_2x"), val = tensor<int32, [4]>([1, 8, 8, -1])];
            tensor<fp16, [1, 8, 8, ?]> reshape_8_cast_fp16 = reshape(shape = concat_2x, x = input_13_cast_fp16)[name = tensor<string, []>("reshape_8_cast_fp16")];
            tensor<int32, [2]> reduce_mean_6_axes_0 = const()[name = tensor<string, []>("reduce_mean_6_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_6_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_6_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 8, 1, 1]> reduce_mean_6_cast_fp16 = reduce_mean(axes = reduce_mean_6_axes_0, keep_dims = reduce_mean_6_keep_dims_0, x = reshape_8_cast_fp16)[name = tensor<string, []>("reduce_mean_6_cast_fp16")];
            tensor<fp16, [1, 8, 8, ?]> sub_4_cast_fp16 = sub(x = reshape_8_cast_fp16, y = reduce_mean_6_cast_fp16)[name = tensor<string, []>("sub_4_cast_fp16")];
            tensor<fp16, [1, 8, 8, ?]> square_2_cast_fp16 = square(x = sub_4_cast_fp16)[name = tensor<string, []>("square_2_cast_fp16")];
            tensor<int32, [2]> reduce_mean_8_axes_0 = const()[name = tensor<string, []>("reduce_mean_8_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_8_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_8_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 8, 1, 1]> reduce_mean_8_cast_fp16 = reduce_mean(axes = reduce_mean_8_axes_0, keep_dims = reduce_mean_8_keep_dims_0, x = square_2_cast_fp16)[name = tensor<string, []>("reduce_mean_8_cast_fp16")];
            tensor<fp16, []> add_4_y_0_to_fp16 = const()[name = tensor<string, []>("add_4_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 8, 1, 1]> add_4_cast_fp16 = add(x = reduce_mean_8_cast_fp16, y = add_4_y_0_to_fp16)[name = tensor<string, []>("add_4_cast_fp16")];
            tensor<fp16, [1, 8, 1, 1]> sqrt_2_cast_fp16 = sqrt(x = add_4_cast_fp16)[name = tensor<string, []>("sqrt_2_cast_fp16")];
            tensor<fp16, [1, 8, 8, ?]> real_div_2_cast_fp16 = real_div(x = sub_4_cast_fp16, y = sqrt_2_cast_fp16)[name = tensor<string, []>("real_div_2_cast_fp16")];
            tensor<fp16, [1, 64, ?]> reshape_9_cast_fp16 = reshape(shape = shape_2_cast_fp16, x = real_div_2_cast_fp16)[name = tensor<string, []>("reshape_9_cast_fp16")];
            tensor<fp16, [1, 64, 1]> reshape_10_to_fp16 = const()[name = tensor<string, []>("reshape_10_to_fp16"), val = tensor<fp16, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(175680)))];
            tensor<fp16, [1, 64, ?]> mul_2_cast_fp16 = mul(x = reshape_9_cast_fp16, y = reshape_10_to_fp16)[name = tensor<string, []>("mul_2_cast_fp16")];
            tensor<fp16, [1, 64, 1]> reshape_11_to_fp16 = const()[name = tensor<string, []>("reshape_11_to_fp16"), val = tensor<fp16, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(175872)))];
            tensor<fp16, [1, 64, ?]> add_5_cast_fp16 = add(x = mul_2_cast_fp16, y = reshape_11_to_fp16)[name = tensor<string, []>("add_5_cast_fp16")];
            tensor<fp16, [1, 64, ?]> input_17_cast_fp16 = silu(x = add_5_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<string, []> input_19_pad_type_0 = const()[name = tensor<string, []>("input_19_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_19_pad_0 = const()[name = tensor<string, []>("input_19_pad_0"), val = tensor<int32, [2]>([6, 6])];
            tensor<int32, [1]> input_19_dilations_0 = const()[name = tensor<string, []>("input_19_dilations_0"), val = tensor<int32, [1]>([2])];
            tensor<int32, [1]> input_19_strides_0 = const()[name = tensor<string, []>("input_19_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_19_groups_0 = const()[name = tensor<string, []>("input_19_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 7]> blocks_1_3_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_3_weight_to_fp16"), val = tensor<fp16, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(176064)))];
            tensor<fp16, [64]> blocks_1_3_bias_to_fp16 = const()[name = tensor<string, []>("blocks_1_3_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(233472)))];
            tensor<fp16, [1, 64, ?]> input_19_cast_fp16 = conv(bias = blocks_1_3_bias_to_fp16, dilations = input_19_dilations_0, groups = input_19_groups_0, pad = input_19_pad_0, pad_type = input_19_pad_type_0, strides = input_19_strides_0, weight = blocks_1_3_weight_to_fp16, x = input_17_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<int32, [3]> shape_3_cast_fp16 = shape(x = input_19_cast_fp16)[name = tensor<string, []>("shape_3_cast_fp16")];
            tensor<int32, [4]> concat_3x = const()[name = tensor<string, []>("concat_3x"), val = tensor<int32, [4]>([1, 8, 8, -1])];
            tensor<fp16, [1, 8, 8, ?]> reshape_12_cast_fp16 = reshape(shape = concat_3x, x = input_19_cast_fp16)[name = tensor<string, []>("reshape_12_cast_fp16")];
            tensor<int32, [2]> reduce_mean_9_axes_0 = const()[name = tensor<string, []>("reduce_mean_9_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_9_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_9_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 8, 1, 1]> reduce_mean_9_cast_fp16 = reduce_mean(axes = reduce_mean_9_axes_0, keep_dims = reduce_mean_9_keep_dims_0, x = reshape_12_cast_fp16)[name = tensor<string, []>("reduce_mean_9_cast_fp16")];
            tensor<fp16, [1, 8, 8, ?]> sub_6_cast_fp16 = sub(x = reshape_12_cast_fp16, y = reduce_mean_9_cast_fp16)[name = tensor<string, []>("sub_6_cast_fp16")];
            tensor<fp16, [1, 8, 8, ?]> square_3_cast_fp16 = square(x = sub_6_cast_fp16)[name = tensor<string, []>("square_3_cast_fp16")];
            tensor<int32, [2]> reduce_mean_11_axes_0 = const()[name = tensor<string, []>("reduce_mean_11_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_11_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_11_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 8, 1, 1]> reduce_mean_11_cast_fp16 = reduce_mean(axes = reduce_mean_11_axes_0, keep_dims = reduce_mean_11_keep_dims_0, x = square_3_cast_fp16)[name = tensor<string, []>("reduce_mean_11_cast_fp16")];
            tensor<fp16, []> add_6_y_0_to_fp16 = const()[name = tensor<string, []>("add_6_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 8, 1, 1]> add_6_cast_fp16 = add(x = reduce_mean_11_cast_fp16, y = add_6_y_0_to_fp16)[name = tensor<string, []>("add_6_cast_fp16")];
            tensor<fp16, [1, 8, 1, 1]> sqrt_3_cast_fp16 = sqrt(x = add_6_cast_fp16)[name = tensor<string, []>("sqrt_3_cast_fp16")];
            tensor<fp16, [1, 8, 8, ?]> real_div_3_cast_fp16 = real_div(x = sub_6_cast_fp16, y = sqrt_3_cast_fp16)[name = tensor<string, []>("real_div_3_cast_fp16")];
            tensor<fp16, [1, 64, ?]> reshape_13_cast_fp16 = reshape(shape = shape_3_cast_fp16, x = real_div_3_cast_fp16)[name = tensor<string, []>("reshape_13_cast_fp16")];
            tensor<fp16, [1, 64, 1]> reshape_14_to_fp16 = const()[name = tensor<string, []>("reshape_14_to_fp16"), val = tensor<fp16, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(233664)))];
            tensor<fp16, [1, 64, ?]> mul_3_cast_fp16 = mul(x = reshape_13_cast_fp16, y = reshape_14_to_fp16)[name = tensor<string, []>("mul_3_cast_fp16")];
            tensor<fp16, [1, 64, 1]> reshape_15_to_fp16 = const()[name = tensor<string, []>("reshape_15_to_fp16"), val = tensor<fp16, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(233856)))];
            tensor<fp16, [1, 64, ?]> add_7_cast_fp16 = add(x = mul_3_cast_fp16, y = reshape_15_to_fp16)[name = tensor<string, []>("add_7_cast_fp16")];
            tensor<fp16, [1, 64, ?]> input_21_cast_fp16 = add(x = input_11_cast_fp16, y = add_7_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<string, []> input_23_pad_type_0 = const()[name = tensor<string, []>("input_23_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_23_pad_0 = const()[name = tensor<string, []>("input_23_pad_0"), val = tensor<int32, [2]>([12, 12])];
            tensor<int32, [1]> input_23_dilations_0 = const()[name = tensor<string, []>("input_23_dilations_0"), val = tensor<int32, [1]>([4])];
            tensor<int32, [1]> input_23_strides_0 = const()[name = tensor<string, []>("input_23_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_23_groups_0 = const()[name = tensor<string, []>("input_23_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 7]> blocks_2_0_weight_to_fp16 = const()[name = tensor<string, []>("blocks_2_0_weight_to_fp16"), val = tensor<fp16, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(234048)))];
            tensor<fp16, [64]> blocks_2_0_bias_to_fp16 = const()[name = tensor<string, []>("blocks_2_0_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(291456)))];
            tensor<fp16, [1, 64, ?]> input_23_cast_fp16 = conv(bias = blocks_2_0_bias_to_fp16, dilations = input_23_dilations_0, groups = input_23_groups_0, pad = input_23_pad_0, pad_type = input_23_pad_type_0, strides = input_23_strides_0, weight = blocks_2_0_weight_to_fp16, x = input_21_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<int32, [3]> shape_4_cast_fp16 = shape(x = input_23_cast_fp16)[name = tensor<string, []>("shape_4_cast_fp16")];
            tensor<int32, [4]> concat_4x = const()[name = tensor<string, []>("concat_4x"), val = tensor<int32, [4]>([1, 8, 8, -1])];
            tensor<fp16, [1, 8, 8, ?]> reshape_16_cast_fp16 = reshape(shape = concat_4x, x = input_23_cast_fp16)[name = tensor<string, []>("reshape_16_cast_fp16")];
            tensor<int32, [2]> reduce_mean_12_axes_0 = const()[name = tensor<string, []>("reduce_mean_12_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_12_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_12_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 8, 1, 1]> reduce_mean_12_cast_fp16 = reduce_mean(axes = reduce_mean_12_axes_0, keep_dims = reduce_mean_12_keep_dims_0, x = reshape_16_cast_fp16)[name = tensor<string, []>("reduce_mean_12_cast_fp16")];
            tensor<fp16, [1, 8, 8, ?]> sub_8_cast_fp16 = sub(x = reshape_16_cast_fp16, y = reduce_mean_12_cast_fp16)[name = tensor<string, []>("sub_8_cast_fp16")];
            tensor<fp16, [1, 8, 8, ?]> square_4_cast_fp16 = square(x = sub_8_cast_fp16)[name = tensor<string, []>("square_4_cast_fp16")];
            tensor<int32, [2]> reduce_mean_14_axes_0 = const()[name = tensor<string, []>("reduce_mean_14_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_14_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_14_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 8, 1, 1]> reduce_mean_14_cast_fp16 = reduce_mean(axes = reduce_mean_14_axes_0, keep_dims = reduce_mean_14_keep_dims_0, x = square_4_cast_fp16)[name = tensor<string, []>("reduce_mean_14_cast_fp16")];
            tensor<fp16, []> add_8_y_0_to_fp16 = const()[name = tensor<string, []>("add_8_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 8, 1, 1]> add_8_cast_fp16 = add(x = reduce_mean_14_cast_fp16, y = add_8_y_0_to_fp16)[name = tensor<string, []>("add_8_cast_fp16")];
            tensor<fp16, [1, 8, 1, 1]> sqrt_4_cast_fp16 = sqrt(x = add_8_cast_fp16)[name = tensor<string, []>("sqrt_4_cast_fp16")];
            tensor<fp16, [1, 8, 8, ?]> real_div_4_cast_fp16 = real_div(x = sub_8_cast_fp16, y = sqrt_4_cast_fp16)[name = tensor<string, []>("real_div_4_cast_fp16")];
            tensor<fp16, [1, 64, ?]> reshape_17_cast_fp16 = reshape(shape = shape_4_cast_fp16, x = real_div_4_cast_fp16)[name = tensor<string, []>("reshape_17_cast_fp16")];
            tensor<fp16, [1, 64, 1]> reshape_18_to_fp16 = const()[name = tensor<string, []>("reshape_18_to_fp16"), val = tensor<fp16, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(291648)))];
            tensor<fp16, [1, 64, ?]> mul_4_cast_fp16 = mul(x = reshape_17_cast_fp16, y = reshape_18_to_fp16)[name = tensor<string, []>("mul_4_cast_fp16")];
            tensor<fp16, [1, 64, 1]> reshape_19_to_fp16 = const()[name = tensor<string, []>("reshape_19_to_fp16"), val = tensor<fp16, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(291840)))];
            tensor<fp16, [1, 64, ?]> add_9_cast_fp16 = add(x = mul_4_cast_fp16, y = reshape_19_to_fp16)[name = tensor<string, []>("add_9_cast_fp16")];
            tensor<fp16, [1, 64, ?]> input_27_cast_fp16 = silu(x = add_9_cast_fp16)[name = tensor<string, []>("input_27_cast_fp16")];
            tensor<string, []> input_29_pad_type_0 = const()[name = tensor<string, []>("input_29_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_29_pad_0 = const()[name = tensor<string, []>("input_29_pad_0"), val = tensor<int32, [2]>([12, 12])];
            tensor<int32, [1]> input_29_dilations_0 = const()[name = tensor<string, []>("input_29_dilations_0"), val = tensor<int32, [1]>([4])];
            tensor<int32, [1]> input_29_strides_0 = const()[name = tensor<string, []>("input_29_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_29_groups_0 = const()[name = tensor<string, []>("input_29_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 7]> blocks_2_3_weight_to_fp16 = const()[name = tensor<string, []>("blocks_2_3_weight_to_fp16"), val = tensor<fp16, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(292032)))];
            tensor<fp16, [64]> blocks_2_3_bias_to_fp16 = const()[name = tensor<string, []>("blocks_2_3_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(349440)))];
            tensor<fp16, [1, 64, ?]> input_29_cast_fp16 = conv(bias = blocks_2_3_bias_to_fp16, dilations = input_29_dilations_0, groups = input_29_groups_0, pad = input_29_pad_0, pad_type = input_29_pad_type_0, strides = input_29_strides_0, weight = blocks_2_3_weight_to_fp16, x = input_27_cast_fp16)[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<int32, [3]> shape_5_cast_fp16 = shape(x = input_29_cast_fp16)[name = tensor<string, []>("shape_5_cast_fp16")];
            tensor<int32, [4]> concat_5x = const()[name = tensor<string, []>("concat_5x"), val = tensor<int32, [4]>([1, 8, 8, -1])];
            tensor<fp16, [1, 8, 8, ?]> reshape_20_cast_fp16 = reshape(shape = concat_5x, x = input_29_cast_fp16)[name = tensor<string, []>("reshape_20_cast_fp16")];
            tensor<int32, [2]> reduce_mean_15_axes_0 = const()[name = tensor<string, []>("reduce_mean_15_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_15_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_15_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 8, 1, 1]> reduce_mean_15_cast_fp16 = reduce_mean(axes = reduce_mean_15_axes_0, keep_dims = reduce_mean_15_keep_dims_0, x = reshape_20_cast_fp16)[name = tensor<string, []>("reduce_mean_15_cast_fp16")];
            tensor<fp16, [1, 8, 8, ?]> sub_10_cast_fp16 = sub(x = reshape_20_cast_fp16, y = reduce_mean_15_cast_fp16)[name = tensor<string, []>("sub_10_cast_fp16")];
            tensor<fp16, [1, 8, 8, ?]> square_5_cast_fp16 = square(x = sub_10_cast_fp16)[name = tensor<string, []>("square_5_cast_fp16")];
            tensor<int32, [2]> reduce_mean_17_axes_0 = const()[name = tensor<string, []>("reduce_mean_17_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_17_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_17_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 8, 1, 1]> reduce_mean_17_cast_fp16 = reduce_mean(axes = reduce_mean_17_axes_0, keep_dims = reduce_mean_17_keep_dims_0, x = square_5_cast_fp16)[name = tensor<string, []>("reduce_mean_17_cast_fp16")];
            tensor<fp16, []> add_10_y_0_to_fp16 = const()[name = tensor<string, []>("add_10_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 8, 1, 1]> add_10_cast_fp16 = add(x = reduce_mean_17_cast_fp16, y = add_10_y_0_to_fp16)[name = tensor<string, []>("add_10_cast_fp16")];
            tensor<fp16, [1, 8, 1, 1]> sqrt_5_cast_fp16 = sqrt(x = add_10_cast_fp16)[name = tensor<string, []>("sqrt_5_cast_fp16")];
            tensor<fp16, [1, 8, 8, ?]> real_div_5_cast_fp16 = real_div(x = sub_10_cast_fp16, y = sqrt_5_cast_fp16)[name = tensor<string, []>("real_div_5_cast_fp16")];
            tensor<fp16, [1, 64, ?]> reshape_21_cast_fp16 = reshape(shape = shape_5_cast_fp16, x = real_div_5_cast_fp16)[name = tensor<string, []>("reshape_21_cast_fp16")];
            tensor<fp16, [1, 64, 1]> reshape_22_to_fp16 = const()[name = tensor<string, []>("reshape_22_to_fp16"), val = tensor<fp16, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(349632)))];
            tensor<fp16, [1, 64, ?]> mul_5_cast_fp16 = mul(x = reshape_21_cast_fp16, y = reshape_22_to_fp16)[name = tensor<string, []>("mul_5_cast_fp16")];
            tensor<fp16, [1, 64, 1]> reshape_23_to_fp16 = const()[name = tensor<string, []>("reshape_23_to_fp16"), val = tensor<fp16, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(349824)))];
            tensor<fp16, [1, 64, ?]> add_11_cast_fp16 = add(x = mul_5_cast_fp16, y = reshape_23_to_fp16)[name = tensor<string, []>("add_11_cast_fp16")];
            tensor<fp16, [1, 64, ?]> input_31_cast_fp16 = add(x = input_21_cast_fp16, y = add_11_cast_fp16)[name = tensor<string, []>("input_31_cast_fp16")];
            tensor<string, []> input_33_pad_type_0 = const()[name = tensor<string, []>("input_33_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_33_pad_0 = const()[name = tensor<string, []>("input_33_pad_0"), val = tensor<int32, [2]>([24, 24])];
            tensor<int32, [1]> input_33_dilations_0 = const()[name = tensor<string, []>("input_33_dilations_0"), val = tensor<int32, [1]>([8])];
            tensor<int32, [1]> input_33_strides_0 = const()[name = tensor<string, []>("input_33_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_33_groups_0 = const()[name = tensor<string, []>("input_33_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 7]> blocks_3_0_weight_to_fp16 = const()[name = tensor<string, []>("blocks_3_0_weight_to_fp16"), val = tensor<fp16, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(350016)))];
            tensor<fp16, [64]> blocks_3_0_bias_to_fp16 = const()[name = tensor<string, []>("blocks_3_0_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(407424)))];
            tensor<fp16, [1, 64, ?]> input_33_cast_fp16 = conv(bias = blocks_3_0_bias_to_fp16, dilations = input_33_dilations_0, groups = input_33_groups_0, pad = input_33_pad_0, pad_type = input_33_pad_type_0, strides = input_33_strides_0, weight = blocks_3_0_weight_to_fp16, x = input_31_cast_fp16)[name = tensor<string, []>("input_33_cast_fp16")];
            tensor<int32, [3]> shape_6_cast_fp16 = shape(x = input_33_cast_fp16)[name = tensor<string, []>("shape_6_cast_fp16")];
            tensor<int32, [4]> concat_6x = const()[name = tensor<string, []>("concat_6x"), val = tensor<int32, [4]>([1, 8, 8, -1])];
            tensor<fp16, [1, 8, 8, ?]> reshape_24_cast_fp16 = reshape(shape = concat_6x, x = input_33_cast_fp16)[name = tensor<string, []>("reshape_24_cast_fp16")];
            tensor<int32, [2]> reduce_mean_18_axes_0 = const()[name = tensor<string, []>("reduce_mean_18_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_18_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_18_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 8, 1, 1]> reduce_mean_18_cast_fp16 = reduce_mean(axes = reduce_mean_18_axes_0, keep_dims = reduce_mean_18_keep_dims_0, x = reshape_24_cast_fp16)[name = tensor<string, []>("reduce_mean_18_cast_fp16")];
            tensor<fp16, [1, 8, 8, ?]> sub_12_cast_fp16 = sub(x = reshape_24_cast_fp16, y = reduce_mean_18_cast_fp16)[name = tensor<string, []>("sub_12_cast_fp16")];
            tensor<fp16, [1, 8, 8, ?]> square_6_cast_fp16 = square(x = sub_12_cast_fp16)[name = tensor<string, []>("square_6_cast_fp16")];
            tensor<int32, [2]> reduce_mean_20_axes_0 = const()[name = tensor<string, []>("reduce_mean_20_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_20_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_20_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 8, 1, 1]> reduce_mean_20_cast_fp16 = reduce_mean(axes = reduce_mean_20_axes_0, keep_dims = reduce_mean_20_keep_dims_0, x = square_6_cast_fp16)[name = tensor<string, []>("reduce_mean_20_cast_fp16")];
            tensor<fp16, []> add_12_y_0_to_fp16 = const()[name = tensor<string, []>("add_12_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 8, 1, 1]> add_12_cast_fp16 = add(x = reduce_mean_20_cast_fp16, y = add_12_y_0_to_fp16)[name = tensor<string, []>("add_12_cast_fp16")];
            tensor<fp16, [1, 8, 1, 1]> sqrt_6_cast_fp16 = sqrt(x = add_12_cast_fp16)[name = tensor<string, []>("sqrt_6_cast_fp16")];
            tensor<fp16, [1, 8, 8, ?]> real_div_6_cast_fp16 = real_div(x = sub_12_cast_fp16, y = sqrt_6_cast_fp16)[name = tensor<string, []>("real_div_6_cast_fp16")];
            tensor<fp16, [1, 64, ?]> reshape_25_cast_fp16 = reshape(shape = shape_6_cast_fp16, x = real_div_6_cast_fp16)[name = tensor<string, []>("reshape_25_cast_fp16")];
            tensor<fp16, [1, 64, 1]> reshape_26_to_fp16 = const()[name = tensor<string, []>("reshape_26_to_fp16"), val = tensor<fp16, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(407616)))];
            tensor<fp16, [1, 64, ?]> mul_6_cast_fp16 = mul(x = reshape_25_cast_fp16, y = reshape_26_to_fp16)[name = tensor<string, []>("mul_6_cast_fp16")];
            tensor<fp16, [1, 64, 1]> reshape_27_to_fp16 = const()[name = tensor<string, []>("reshape_27_to_fp16"), val = tensor<fp16, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(407808)))];
            tensor<fp16, [1, 64, ?]> add_13_cast_fp16 = add(x = mul_6_cast_fp16, y = reshape_27_to_fp16)[name = tensor<string, []>("add_13_cast_fp16")];
            tensor<fp16, [1, 64, ?]> input_37_cast_fp16 = silu(x = add_13_cast_fp16)[name = tensor<string, []>("input_37_cast_fp16")];
            tensor<string, []> input_39_pad_type_0 = const()[name = tensor<string, []>("input_39_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_39_pad_0 = const()[name = tensor<string, []>("input_39_pad_0"), val = tensor<int32, [2]>([24, 24])];
            tensor<int32, [1]> input_39_dilations_0 = const()[name = tensor<string, []>("input_39_dilations_0"), val = tensor<int32, [1]>([8])];
            tensor<int32, [1]> input_39_strides_0 = const()[name = tensor<string, []>("input_39_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_39_groups_0 = const()[name = tensor<string, []>("input_39_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 7]> blocks_3_3_weight_to_fp16 = const()[name = tensor<string, []>("blocks_3_3_weight_to_fp16"), val = tensor<fp16, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(408000)))];
            tensor<fp16, [64]> blocks_3_3_bias_to_fp16 = const()[name = tensor<string, []>("blocks_3_3_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(465408)))];
            tensor<fp16, [1, 64, ?]> input_39_cast_fp16 = conv(bias = blocks_3_3_bias_to_fp16, dilations = input_39_dilations_0, groups = input_39_groups_0, pad = input_39_pad_0, pad_type = input_39_pad_type_0, strides = input_39_strides_0, weight = blocks_3_3_weight_to_fp16, x = input_37_cast_fp16)[name = tensor<string, []>("input_39_cast_fp16")];
            tensor<int32, [3]> shape_7_cast_fp16 = shape(x = input_39_cast_fp16)[name = tensor<string, []>("shape_7_cast_fp16")];
            tensor<int32, [4]> concat_7x = const()[name = tensor<string, []>("concat_7x"), val = tensor<int32, [4]>([1, 8, 8, -1])];
            tensor<fp16, [1, 8, 8, ?]> reshape_28_cast_fp16 = reshape(shape = concat_7x, x = input_39_cast_fp16)[name = tensor<string, []>("reshape_28_cast_fp16")];
            tensor<int32, [2]> reduce_mean_21_axes_0 = const()[name = tensor<string, []>("reduce_mean_21_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_21_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_21_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 8, 1, 1]> reduce_mean_21_cast_fp16 = reduce_mean(axes = reduce_mean_21_axes_0, keep_dims = reduce_mean_21_keep_dims_0, x = reshape_28_cast_fp16)[name = tensor<string, []>("reduce_mean_21_cast_fp16")];
            tensor<fp16, [1, 8, 8, ?]> sub_14_cast_fp16 = sub(x = reshape_28_cast_fp16, y = reduce_mean_21_cast_fp16)[name = tensor<string, []>("sub_14_cast_fp16")];
            tensor<fp16, [1, 8, 8, ?]> square_7_cast_fp16 = square(x = sub_14_cast_fp16)[name = tensor<string, []>("square_7_cast_fp16")];
            tensor<int32, [2]> reduce_mean_23_axes_0 = const()[name = tensor<string, []>("reduce_mean_23_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_23_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_23_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 8, 1, 1]> reduce_mean_23_cast_fp16 = reduce_mean(axes = reduce_mean_23_axes_0, keep_dims = reduce_mean_23_keep_dims_0, x = square_7_cast_fp16)[name = tensor<string, []>("reduce_mean_23_cast_fp16")];
            tensor<fp16, []> add_14_y_0_to_fp16 = const()[name = tensor<string, []>("add_14_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 8, 1, 1]> add_14_cast_fp16 = add(x = reduce_mean_23_cast_fp16, y = add_14_y_0_to_fp16)[name = tensor<string, []>("add_14_cast_fp16")];
            tensor<fp16, [1, 8, 1, 1]> sqrt_7_cast_fp16 = sqrt(x = add_14_cast_fp16)[name = tensor<string, []>("sqrt_7_cast_fp16")];
            tensor<fp16, [1, 8, 8, ?]> real_div_7_cast_fp16 = real_div(x = sub_14_cast_fp16, y = sqrt_7_cast_fp16)[name = tensor<string, []>("real_div_7_cast_fp16")];
            tensor<fp16, [1, 64, ?]> reshape_29_cast_fp16 = reshape(shape = shape_7_cast_fp16, x = real_div_7_cast_fp16)[name = tensor<string, []>("reshape_29_cast_fp16")];
            tensor<fp16, [1, 64, 1]> reshape_30_to_fp16 = const()[name = tensor<string, []>("reshape_30_to_fp16"), val = tensor<fp16, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(465600)))];
            tensor<fp16, [1, 64, ?]> mul_7_cast_fp16 = mul(x = reshape_29_cast_fp16, y = reshape_30_to_fp16)[name = tensor<string, []>("mul_7_cast_fp16")];
            tensor<fp16, [1, 64, 1]> reshape_31_to_fp16 = const()[name = tensor<string, []>("reshape_31_to_fp16"), val = tensor<fp16, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(465792)))];
            tensor<fp16, [1, 64, ?]> add_15_cast_fp16 = add(x = mul_7_cast_fp16, y = reshape_31_to_fp16)[name = tensor<string, []>("add_15_cast_fp16")];
            tensor<fp16, [1, 64, ?]> input_41_cast_fp16 = add(x = input_31_cast_fp16, y = add_15_cast_fp16)[name = tensor<string, []>("input_41_cast_fp16")];
            tensor<string, []> input_43_pad_type_0 = const()[name = tensor<string, []>("input_43_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_43_pad_0 = const()[name = tensor<string, []>("input_43_pad_0"), val = tensor<int32, [2]>([48, 48])];
            tensor<int32, [1]> input_43_dilations_0 = const()[name = tensor<string, []>("input_43_dilations_0"), val = tensor<int32, [1]>([16])];
            tensor<int32, [1]> input_43_strides_0 = const()[name = tensor<string, []>("input_43_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_43_groups_0 = const()[name = tensor<string, []>("input_43_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 7]> blocks_4_0_weight_to_fp16 = const()[name = tensor<string, []>("blocks_4_0_weight_to_fp16"), val = tensor<fp16, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(465984)))];
            tensor<fp16, [64]> blocks_4_0_bias_to_fp16 = const()[name = tensor<string, []>("blocks_4_0_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(523392)))];
            tensor<fp16, [1, 64, ?]> input_43_cast_fp16 = conv(bias = blocks_4_0_bias_to_fp16, dilations = input_43_dilations_0, groups = input_43_groups_0, pad = input_43_pad_0, pad_type = input_43_pad_type_0, strides = input_43_strides_0, weight = blocks_4_0_weight_to_fp16, x = input_41_cast_fp16)[name = tensor<string, []>("input_43_cast_fp16")];
            tensor<int32, [3]> shape_8_cast_fp16 = shape(x = input_43_cast_fp16)[name = tensor<string, []>("shape_8_cast_fp16")];
            tensor<int32, [4]> concat_8x = const()[name = tensor<string, []>("concat_8x"), val = tensor<int32, [4]>([1, 8, 8, -1])];
            tensor<fp16, [1, 8, 8, ?]> reshape_32_cast_fp16 = reshape(shape = concat_8x, x = input_43_cast_fp16)[name = tensor<string, []>("reshape_32_cast_fp16")];
            tensor<int32, [2]> reduce_mean_24_axes_0 = const()[name = tensor<string, []>("reduce_mean_24_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_24_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_24_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 8, 1, 1]> reduce_mean_24_cast_fp16 = reduce_mean(axes = reduce_mean_24_axes_0, keep_dims = reduce_mean_24_keep_dims_0, x = reshape_32_cast_fp16)[name = tensor<string, []>("reduce_mean_24_cast_fp16")];
            tensor<fp16, [1, 8, 8, ?]> sub_16_cast_fp16 = sub(x = reshape_32_cast_fp16, y = reduce_mean_24_cast_fp16)[name = tensor<string, []>("sub_16_cast_fp16")];
            tensor<fp16, [1, 8, 8, ?]> square_8_cast_fp16 = square(x = sub_16_cast_fp16)[name = tensor<string, []>("square_8_cast_fp16")];
            tensor<int32, [2]> reduce_mean_26_axes_0 = const()[name = tensor<string, []>("reduce_mean_26_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_26_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_26_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 8, 1, 1]> reduce_mean_26_cast_fp16 = reduce_mean(axes = reduce_mean_26_axes_0, keep_dims = reduce_mean_26_keep_dims_0, x = square_8_cast_fp16)[name = tensor<string, []>("reduce_mean_26_cast_fp16")];
            tensor<fp16, []> add_16_y_0_to_fp16 = const()[name = tensor<string, []>("add_16_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 8, 1, 1]> add_16_cast_fp16 = add(x = reduce_mean_26_cast_fp16, y = add_16_y_0_to_fp16)[name = tensor<string, []>("add_16_cast_fp16")];
            tensor<fp16, [1, 8, 1, 1]> sqrt_8_cast_fp16 = sqrt(x = add_16_cast_fp16)[name = tensor<string, []>("sqrt_8_cast_fp16")];
            tensor<fp16, [1, 8, 8, ?]> real_div_8_cast_fp16 = real_div(x = sub_16_cast_fp16, y = sqrt_8_cast_fp16)[name = tensor<string, []>("real_div_8_cast_fp16")];
            tensor<fp16, [1, 64, ?]> reshape_33_cast_fp16 = reshape(shape = shape_8_cast_fp16, x = real_div_8_cast_fp16)[name = tensor<string, []>("reshape_33_cast_fp16")];
            tensor<fp16, [1, 64, 1]> reshape_34_to_fp16 = const()[name = tensor<string, []>("reshape_34_to_fp16"), val = tensor<fp16, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(523584)))];
            tensor<fp16, [1, 64, ?]> mul_8_cast_fp16 = mul(x = reshape_33_cast_fp16, y = reshape_34_to_fp16)[name = tensor<string, []>("mul_8_cast_fp16")];
            tensor<fp16, [1, 64, 1]> reshape_35_to_fp16 = const()[name = tensor<string, []>("reshape_35_to_fp16"), val = tensor<fp16, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(523776)))];
            tensor<fp16, [1, 64, ?]> add_17_cast_fp16 = add(x = mul_8_cast_fp16, y = reshape_35_to_fp16)[name = tensor<string, []>("add_17_cast_fp16")];
            tensor<fp16, [1, 64, ?]> input_47_cast_fp16 = silu(x = add_17_cast_fp16)[name = tensor<string, []>("input_47_cast_fp16")];
            tensor<string, []> input_49_pad_type_0 = const()[name = tensor<string, []>("input_49_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_49_pad_0 = const()[name = tensor<string, []>("input_49_pad_0"), val = tensor<int32, [2]>([48, 48])];
            tensor<int32, [1]> input_49_dilations_0 = const()[name = tensor<string, []>("input_49_dilations_0"), val = tensor<int32, [1]>([16])];
            tensor<int32, [1]> input_49_strides_0 = const()[name = tensor<string, []>("input_49_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_49_groups_0 = const()[name = tensor<string, []>("input_49_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 7]> blocks_4_3_weight_to_fp16 = const()[name = tensor<string, []>("blocks_4_3_weight_to_fp16"), val = tensor<fp16, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(523968)))];
            tensor<fp16, [64]> blocks_4_3_bias_to_fp16 = const()[name = tensor<string, []>("blocks_4_3_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(581376)))];
            tensor<fp16, [1, 64, ?]> input_49_cast_fp16 = conv(bias = blocks_4_3_bias_to_fp16, dilations = input_49_dilations_0, groups = input_49_groups_0, pad = input_49_pad_0, pad_type = input_49_pad_type_0, strides = input_49_strides_0, weight = blocks_4_3_weight_to_fp16, x = input_47_cast_fp16)[name = tensor<string, []>("input_49_cast_fp16")];
            tensor<int32, [3]> shape_9_cast_fp16 = shape(x = input_49_cast_fp16)[name = tensor<string, []>("shape_9_cast_fp16")];
            tensor<int32, [4]> concat_9x = const()[name = tensor<string, []>("concat_9x"), val = tensor<int32, [4]>([1, 8, 8, -1])];
