program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3304.5.2"}, {"coremlc-version", "3304.6.2"}, {"coremltools-component-torch", "2.7.1"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "8.3.0"}})]
{
    func main<ios16>(tensor<fp32, [1, 2, ?]> audio_in) [FlexibleShapeInformation = tuple<tuple<tensor<string, []>, dict<tensor<string, []>, tensor<int32, [?]>>>, tuple<tensor<string, []>, dict<tensor<string, []>, list<tensor<int32, [2]>, ?>>>>((("DefaultShapes", {{"audio_in", [1, 2, 1]}}), ("RangeDims", {{"audio_in", [[1, 1], [2, 2], [1, 65536]]}})))] {
            tensor<fp32, []> residual_scale = const()[name = tensor<string, []>("residual_scale"), val = tensor<fp32, []>(0x1.b1764ap-4)];
            tensor<fp32, [64]> input_proj_bias = const()[name = tensor<string, []>("input_proj_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp32, [64, 2, 7]> input_proj_weight = const()[name = tensor<string, []>("input_proj_weight"), val = tensor<fp32, [64, 2, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(384)))];
            tensor<fp32, [64]> blocks_0_conv1_bias = const()[name = tensor<string, []>("blocks_0_conv1_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4032)))];
            tensor<fp32, [64, 64, 7]> blocks_0_conv1_weight = const()[name = tensor<string, []>("blocks_0_conv1_weight"), val = tensor<fp32, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4352)))];
            tensor<fp32, [64]> blocks_0_conv2_bias = const()[name = tensor<string, []>("blocks_0_conv2_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(119104)))];
            tensor<fp32, [64, 64, 7]> blocks_0_conv2_weight = const()[name = tensor<string, []>("blocks_0_conv2_weight"), val = tensor<fp32, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(119424)))];
            tensor<fp32, [64]> blocks_1_conv1_bias = const()[name = tensor<string, []>("blocks_1_conv1_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(234176)))];
            tensor<fp32, [64, 64, 7]> blocks_1_conv1_weight = const()[name = tensor<string, []>("blocks_1_conv1_weight"), val = tensor<fp32, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(234496)))];
            tensor<fp32, [64]> blocks_1_conv2_bias = const()[name = tensor<string, []>("blocks_1_conv2_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(349248)))];
            tensor<fp32, [64, 64, 7]> blocks_1_conv2_weight = const()[name = tensor<string, []>("blocks_1_conv2_weight"), val = tensor<fp32, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(349568)))];
            tensor<fp32, [64]> blocks_2_conv1_bias = const()[name = tensor<string, []>("blocks_2_conv1_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(464320)))];
            tensor<fp32, [64, 64, 7]> blocks_2_conv1_weight = const()[name = tensor<string, []>("blocks_2_conv1_weight"), val = tensor<fp32, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(464640)))];
            tensor<fp32, [64]> blocks_2_conv2_bias = const()[name = tensor<string, []>("blocks_2_conv2_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(579392)))];
            tensor<fp32, [64, 64, 7]> blocks_2_conv2_weight = const()[name = tensor<string, []>("blocks_2_conv2_weight"), val = tensor<fp32, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(579712)))];
            tensor<fp32, [64]> blocks_3_conv1_bias = const()[name = tensor<string, []>("blocks_3_conv1_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(694464)))];
            tensor<fp32, [64, 64, 7]> blocks_3_conv1_weight = const()[name = tensor<string, []>("blocks_3_conv1_weight"), val = tensor<fp32, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(694784)))];
            tensor<fp32, [64]> blocks_3_conv2_bias = const()[name = tensor<string, []>("blocks_3_conv2_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(809536)))];
            tensor<fp32, [64, 64, 7]> blocks_3_conv2_weight = const()[name = tensor<string, []>("blocks_3_conv2_weight"), val = tensor<fp32, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(809856)))];
            tensor<fp32, [64]> blocks_4_conv1_bias = const()[name = tensor<string, []>("blocks_4_conv1_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(924608)))];
            tensor<fp32, [64, 64, 7]> blocks_4_conv1_weight = const()[name = tensor<string, []>("blocks_4_conv1_weight"), val = tensor<fp32, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(924928)))];
            tensor<fp32, [64]> blocks_4_conv2_bias = const()[name = tensor<string, []>("blocks_4_conv2_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1039680)))];
            tensor<fp32, [64, 64, 7]> blocks_4_conv2_weight = const()[name = tensor<string, []>("blocks_4_conv2_weight"), val = tensor<fp32, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1040000)))];
            tensor<fp32, [64]> blocks_5_conv1_bias = const()[name = tensor<string, []>("blocks_5_conv1_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1154752)))];
            tensor<fp32, [64, 64, 7]> blocks_5_conv1_weight = const()[name = tensor<string, []>("blocks_5_conv1_weight"), val = tensor<fp32, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1155072)))];
            tensor<fp32, [64]> blocks_5_conv2_bias = const()[name = tensor<string, []>("blocks_5_conv2_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1269824)))];
            tensor<fp32, [64, 64, 7]> blocks_5_conv2_weight = const()[name = tensor<string, []>("blocks_5_conv2_weight"), val = tensor<fp32, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1270144)))];
            tensor<fp32, [64]> blocks_6_conv1_bias = const()[name = tensor<string, []>("blocks_6_conv1_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1384896)))];
            tensor<fp32, [64, 64, 7]> blocks_6_conv1_weight = const()[name = tensor<string, []>("blocks_6_conv1_weight"), val = tensor<fp32, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1385216)))];
            tensor<fp32, [64]> blocks_6_conv2_bias = const()[name = tensor<string, []>("blocks_6_conv2_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1499968)))];
            tensor<fp32, [64, 64, 7]> blocks_6_conv2_weight = const()[name = tensor<string, []>("blocks_6_conv2_weight"), val = tensor<fp32, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1500288)))];
            tensor<fp32, [64]> blocks_7_conv1_bias = const()[name = tensor<string, []>("blocks_7_conv1_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1615040)))];
            tensor<fp32, [64, 64, 7]> blocks_7_conv1_weight = const()[name = tensor<string, []>("blocks_7_conv1_weight"), val = tensor<fp32, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1615360)))];
            tensor<fp32, [64]> blocks_7_conv2_bias = const()[name = tensor<string, []>("blocks_7_conv2_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1730112)))];
            tensor<fp32, [64, 64, 7]> blocks_7_conv2_weight = const()[name = tensor<string, []>("blocks_7_conv2_weight"), val = tensor<fp32, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1730432)))];
            tensor<fp32, [64]> blocks_8_conv1_bias = const()[name = tensor<string, []>("blocks_8_conv1_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1845184)))];
            tensor<fp32, [64, 64, 7]> blocks_8_conv1_weight = const()[name = tensor<string, []>("blocks_8_conv1_weight"), val = tensor<fp32, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1845504)))];
            tensor<fp32, [64]> blocks_8_conv2_bias = const()[name = tensor<string, []>("blocks_8_conv2_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1960256)))];
            tensor<fp32, [64, 64, 7]> blocks_8_conv2_weight = const()[name = tensor<string, []>("blocks_8_conv2_weight"), val = tensor<fp32, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1960576)))];
            tensor<fp32, [64]> blocks_9_conv1_bias = const()[name = tensor<string, []>("blocks_9_conv1_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2075328)))];
            tensor<fp32, [64, 64, 7]> blocks_9_conv1_weight = const()[name = tensor<string, []>("blocks_9_conv1_weight"), val = tensor<fp32, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2075648)))];
            tensor<fp32, [64]> blocks_9_conv2_bias = const()[name = tensor<string, []>("blocks_9_conv2_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2190400)))];
            tensor<fp32, [64, 64, 7]> blocks_9_conv2_weight = const()[name = tensor<string, []>("blocks_9_conv2_weight"), val = tensor<fp32, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2190720)))];
            tensor<fp32, [64]> blocks_10_conv1_bias = const()[name = tensor<string, []>("blocks_10_conv1_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2305472)))];
            tensor<fp32, [64, 64, 7]> blocks_10_conv1_weight = const()[name = tensor<string, []>("blocks_10_conv1_weight"), val = tensor<fp32, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2305792)))];
            tensor<fp32, [64]> blocks_10_conv2_bias = const()[name = tensor<string, []>("blocks_10_conv2_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2420544)))];
            tensor<fp32, [64, 64, 7]> blocks_10_conv2_weight = const()[name = tensor<string, []>("blocks_10_conv2_weight"), val = tensor<fp32, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2420864)))];
            tensor<fp32, [64]> blocks_11_conv1_bias = const()[name = tensor<string, []>("blocks_11_conv1_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2535616)))];
            tensor<fp32, [64, 64, 7]> blocks_11_conv1_weight = const()[name = tensor<string, []>("blocks_11_conv1_weight"), val = tensor<fp32, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2535936)))];
            tensor<fp32, [64]> blocks_11_conv2_bias = const()[name = tensor<string, []>("blocks_11_conv2_bias"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2650688)))];
            tensor<fp32, [64, 64, 7]> blocks_11_conv2_weight = const()[name = tensor<string, []>("blocks_11_conv2_weight"), val = tensor<fp32, [64, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2651008)))];
            tensor<fp32, [2]> output_proj_bias = const()[name = tensor<string, []>("output_proj_bias"), val = tensor<fp32, [2]>([-0x1.847262p-12, -0x1.9951f6p-16])];
            tensor<fp32, [2, 64, 7]> output_proj_weight = const()[name = tensor<string, []>("output_proj_weight"), val = tensor<fp32, [2, 64, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2765760)))];
            tensor<string, []> input_1_pad_type_0 = const()[name = tensor<string, []>("input_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_1_pad_0 = const()[name = tensor<string, []>("input_1_pad_0"), val = tensor<int32, [2]>([3, 3])];
            tensor<int32, [1]> input_1_strides_0 = const()[name = tensor<string, []>("input_1_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_1_dilations_0 = const()[name = tensor<string, []>("input_1_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_1_groups_0 = const()[name = tensor<string, []>("input_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [1, 64, ?]> input_1 = conv(bias = input_proj_bias, dilations = input_1_dilations_0, groups = input_1_groups_0, pad = input_1_pad_0, pad_type = input_1_pad_type_0, strides = input_1_strides_0, weight = input_proj_weight, x = audio_in)[name = tensor<string, []>("input_1")];
            tensor<string, []> input_3_pad_type_0 = const()[name = tensor<string, []>("input_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_3_pad_0 = const()[name = tensor<string, []>("input_3_pad_0"), val = tensor<int32, [2]>([3, 3])];
            tensor<int32, [1]> input_3_strides_0 = const()[name = tensor<string, []>("input_3_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_3_dilations_0 = const()[name = tensor<string, []>("input_3_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_3_groups_0 = const()[name = tensor<string, []>("input_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [1, 64, ?]> input_3 = conv(bias = blocks_0_conv1_bias, dilations = input_3_dilations_0, groups = input_3_groups_0, pad = input_3_pad_0, pad_type = input_3_pad_type_0, strides = input_3_strides_0, weight = blocks_0_conv1_weight, x = input_1)[name = tensor<string, []>("input_3")];
            tensor<int32, [3]> shape_0 = shape(x = input_3)[name = tensor<string, []>("shape_0")];
            tensor<int32, [4]> concat_0x = const()[name = tensor<string, []>("concat_0x"), val = tensor<int32, [4]>([1, 8, 8, -1])];
            tensor<fp32, [1, 8, 8, ?]> reshape_0 = reshape(shape = concat_0x, x = input_3)[name = tensor<string, []>("reshape_0")];
            tensor<int32, [2]> reduce_mean_0_axes_0 = const()[name = tensor<string, []>("reduce_mean_0_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_0_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_0_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp32, [1, 8, 1, 1]> reduce_mean_0 = reduce_mean(axes = reduce_mean_0_axes_0, keep_dims = reduce_mean_0_keep_dims_0, x = reshape_0)[name = tensor<string, []>("reduce_mean_0")];
            tensor<fp32, [1, 8, 8, ?]> sub_0 = sub(x = reshape_0, y = reduce_mean_0)[name = tensor<string, []>("sub_0")];
            tensor<fp32, [1, 8, 8, ?]> square_0 = square(x = sub_0)[name = tensor<string, []>("square_0")];
            tensor<int32, [2]> reduce_mean_2_axes_0 = const()[name = tensor<string, []>("reduce_mean_2_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_2_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_2_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp32, [1, 8, 1, 1]> reduce_mean_2 = reduce_mean(axes = reduce_mean_2_axes_0, keep_dims = reduce_mean_2_keep_dims_0, x = square_0)[name = tensor<string, []>("reduce_mean_2")];
            tensor<fp32, []> add_0_y_0 = const()[name = tensor<string, []>("add_0_y_0"), val = tensor<fp32, []>(0x1.4f8b58p-17)];
            tensor<fp32, [1, 8, 1, 1]> add_0 = add(x = reduce_mean_2, y = add_0_y_0)[name = tensor<string, []>("add_0")];
            tensor<fp32, [1, 8, 1, 1]> sqrt_0 = sqrt(x = add_0)[name = tensor<string, []>("sqrt_0")];
            tensor<fp32, [1, 8, 8, ?]> real_div_0 = real_div(x = sub_0, y = sqrt_0)[name = tensor<string, []>("real_div_0")];
            tensor<fp32, [1, 64, ?]> reshape_1 = reshape(shape = shape_0, x = real_div_0)[name = tensor<string, []>("reshape_1")];
            tensor<fp32, [1, 64, 1]> reshape_2 = const()[name = tensor<string, []>("reshape_2"), val = tensor<fp32, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2769408)))];
            tensor<fp32, [1, 64, ?]> mul_0 = mul(x = reshape_1, y = reshape_2)[name = tensor<string, []>("mul_0")];
            tensor<fp32, [1, 64, 1]> reshape_3 = const()[name = tensor<string, []>("reshape_3"), val = tensor<fp32, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2769728)))];
            tensor<fp32, [1, 64, ?]> add_1 = add(x = mul_0, y = reshape_3)[name = tensor<string, []>("add_1")];
            tensor<fp32, [1, 64, ?]> input_5 = silu(x = add_1)[name = tensor<string, []>("input_5")];
            tensor<string, []> input_7_pad_type_0 = const()[name = tensor<string, []>("input_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_7_pad_0 = const()[name = tensor<string, []>("input_7_pad_0"), val = tensor<int32, [2]>([3, 3])];
            tensor<int32, [1]> input_7_strides_0 = const()[name = tensor<string, []>("input_7_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_7_dilations_0 = const()[name = tensor<string, []>("input_7_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_7_groups_0 = const()[name = tensor<string, []>("input_7_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [1, 64, ?]> input_7 = conv(bias = blocks_0_conv2_bias, dilations = input_7_dilations_0, groups = input_7_groups_0, pad = input_7_pad_0, pad_type = input_7_pad_type_0, strides = input_7_strides_0, weight = blocks_0_conv2_weight, x = input_5)[name = tensor<string, []>("input_7")];
            tensor<int32, [3]> shape_1 = shape(x = input_7)[name = tensor<string, []>("shape_1")];
            tensor<int32, [4]> concat_1x = const()[name = tensor<string, []>("concat_1x"), val = tensor<int32, [4]>([1, 8, 8, -1])];
            tensor<fp32, [1, 8, 8, ?]> reshape_4 = reshape(shape = concat_1x, x = input_7)[name = tensor<string, []>("reshape_4")];
            tensor<int32, [2]> reduce_mean_3_axes_0 = const()[name = tensor<string, []>("reduce_mean_3_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_3_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_3_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp32, [1, 8, 1, 1]> reduce_mean_3 = reduce_mean(axes = reduce_mean_3_axes_0, keep_dims = reduce_mean_3_keep_dims_0, x = reshape_4)[name = tensor<string, []>("reduce_mean_3")];
            tensor<fp32, [1, 8, 8, ?]> sub_2 = sub(x = reshape_4, y = reduce_mean_3)[name = tensor<string, []>("sub_2")];
            tensor<fp32, [1, 8, 8, ?]> square_1 = square(x = sub_2)[name = tensor<string, []>("square_1")];
            tensor<int32, [2]> reduce_mean_5_axes_0 = const()[name = tensor<string, []>("reduce_mean_5_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_5_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_5_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp32, [1, 8, 1, 1]> reduce_mean_5 = reduce_mean(axes = reduce_mean_5_axes_0, keep_dims = reduce_mean_5_keep_dims_0, x = square_1)[name = tensor<string, []>("reduce_mean_5")];
            tensor<fp32, []> add_2_y_0 = const()[name = tensor<string, []>("add_2_y_0"), val = tensor<fp32, []>(0x1.4f8b58p-17)];
            tensor<fp32, [1, 8, 1, 1]> add_2 = add(x = reduce_mean_5, y = add_2_y_0)[name = tensor<string, []>("add_2")];
            tensor<fp32, [1, 8, 1, 1]> sqrt_1 = sqrt(x = add_2)[name = tensor<string, []>("sqrt_1")];
            tensor<fp32, [1, 8, 8, ?]> real_div_1 = real_div(x = sub_2, y = sqrt_1)[name = tensor<string, []>("real_div_1")];
            tensor<fp32, [1, 64, ?]> reshape_5 = reshape(shape = shape_1, x = real_div_1)[name = tensor<string, []>("reshape_5")];
            tensor<fp32, [1, 64, 1]> reshape_6 = const()[name = tensor<string, []>("reshape_6"), val = tensor<fp32, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2770048)))];
            tensor<fp32, [1, 64, ?]> mul_1 = mul(x = reshape_5, y = reshape_6)[name = tensor<string, []>("mul_1")];
            tensor<fp32, [1, 64, 1]> reshape_7 = const()[name = tensor<string, []>("reshape_7"), val = tensor<fp32, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2770368)))];
            tensor<fp32, [1, 64, ?]> add_3 = add(x = mul_1, y = reshape_7)[name = tensor<string, []>("add_3")];
            tensor<fp32, [1, 64, ?]> input_9 = add(x = add_3, y = input_1)[name = tensor<string, []>("input_9")];
            tensor<string, []> input_11_pad_type_0 = const()[name = tensor<string, []>("input_11_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_11_pad_0 = const()[name = tensor<string, []>("input_11_pad_0"), val = tensor<int32, [2]>([3, 3])];
            tensor<int32, [1]> input_11_strides_0 = const()[name = tensor<string, []>("input_11_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_11_dilations_0 = const()[name = tensor<string, []>("input_11_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_11_groups_0 = const()[name = tensor<string, []>("input_11_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [1, 64, ?]> input_11 = conv(bias = blocks_1_conv1_bias, dilations = input_11_dilations_0, groups = input_11_groups_0, pad = input_11_pad_0, pad_type = input_11_pad_type_0, strides = input_11_strides_0, weight = blocks_1_conv1_weight, x = input_9)[name = tensor<string, []>("input_11")];
            tensor<int32, [3]> shape_2 = shape(x = input_11)[name = tensor<string, []>("shape_2")];
            tensor<int32, [4]> concat_2x = const()[name = tensor<string, []>("concat_2x"), val = tensor<int32, [4]>([1, 8, 8, -1])];
            tensor<fp32, [1, 8, 8, ?]> reshape_8 = reshape(shape = concat_2x, x = input_11)[name = tensor<string, []>("reshape_8")];
            tensor<int32, [2]> reduce_mean_6_axes_0 = const()[name = tensor<string, []>("reduce_mean_6_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_6_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_6_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp32, [1, 8, 1, 1]> reduce_mean_6 = reduce_mean(axes = reduce_mean_6_axes_0, keep_dims = reduce_mean_6_keep_dims_0, x = reshape_8)[name = tensor<string, []>("reduce_mean_6")];
            tensor<fp32, [1, 8, 8, ?]> sub_4 = sub(x = reshape_8, y = reduce_mean_6)[name = tensor<string, []>("sub_4")];
            tensor<fp32, [1, 8, 8, ?]> square_2 = square(x = sub_4)[name = tensor<string, []>("square_2")];
            tensor<int32, [2]> reduce_mean_8_axes_0 = const()[name = tensor<string, []>("reduce_mean_8_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_8_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_8_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp32, [1, 8, 1, 1]> reduce_mean_8 = reduce_mean(axes = reduce_mean_8_axes_0, keep_dims = reduce_mean_8_keep_dims_0, x = square_2)[name = tensor<string, []>("reduce_mean_8")];
            tensor<fp32, []> add_4_y_0 = const()[name = tensor<string, []>("add_4_y_0"), val = tensor<fp32, []>(0x1.4f8b58p-17)];
            tensor<fp32, [1, 8, 1, 1]> add_4 = add(x = reduce_mean_8, y = add_4_y_0)[name = tensor<string, []>("add_4")];
            tensor<fp32, [1, 8, 1, 1]> sqrt_2 = sqrt(x = add_4)[name = tensor<string, []>("sqrt_2")];
            tensor<fp32, [1, 8, 8, ?]> real_div_2 = real_div(x = sub_4, y = sqrt_2)[name = tensor<string, []>("real_div_2")];
            tensor<fp32, [1, 64, ?]> reshape_9 = reshape(shape = shape_2, x = real_div_2)[name = tensor<string, []>("reshape_9")];
            tensor<fp32, [1, 64, 1]> reshape_10 = const()[name = tensor<string, []>("reshape_10"), val = tensor<fp32, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2770688)))];
            tensor<fp32, [1, 64, ?]> mul_2 = mul(x = reshape_9, y = reshape_10)[name = tensor<string, []>("mul_2")];
            tensor<fp32, [1, 64, 1]> reshape_11 = const()[name = tensor<string, []>("reshape_11"), val = tensor<fp32, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2771008)))];
            tensor<fp32, [1, 64, ?]> add_5 = add(x = mul_2, y = reshape_11)[name = tensor<string, []>("add_5")];
            tensor<fp32, [1, 64, ?]> input_13 = silu(x = add_5)[name = tensor<string, []>("input_13")];
            tensor<string, []> input_15_pad_type_0 = const()[name = tensor<string, []>("input_15_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_15_pad_0 = const()[name = tensor<string, []>("input_15_pad_0"), val = tensor<int32, [2]>([3, 3])];
            tensor<int32, [1]> input_15_strides_0 = const()[name = tensor<string, []>("input_15_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_15_dilations_0 = const()[name = tensor<string, []>("input_15_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_15_groups_0 = const()[name = tensor<string, []>("input_15_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [1, 64, ?]> input_15 = conv(bias = blocks_1_conv2_bias, dilations = input_15_dilations_0, groups = input_15_groups_0, pad = input_15_pad_0, pad_type = input_15_pad_type_0, strides = input_15_strides_0, weight = blocks_1_conv2_weight, x = input_13)[name = tensor<string, []>("input_15")];
            tensor<int32, [3]> shape_3 = shape(x = input_15)[name = tensor<string, []>("shape_3")];
            tensor<int32, [4]> concat_3x = const()[name = tensor<string, []>("concat_3x"), val = tensor<int32, [4]>([1, 8, 8, -1])];
            tensor<fp32, [1, 8, 8, ?]> reshape_12 = reshape(shape = concat_3x, x = input_15)[name = tensor<string, []>("reshape_12")];
            tensor<int32, [2]> reduce_mean_9_axes_0 = const()[name = tensor<string, []>("reduce_mean_9_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_9_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_9_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp32, [1, 8, 1, 1]> reduce_mean_9 = reduce_mean(axes = reduce_mean_9_axes_0, keep_dims = reduce_mean_9_keep_dims_0, x = reshape_12)[name = tensor<string, []>("reduce_mean_9")];
            tensor<fp32, [1, 8, 8, ?]> sub_6 = sub(x = reshape_12, y = reduce_mean_9)[name = tensor<string, []>("sub_6")];
            tensor<fp32, [1, 8, 8, ?]> square_3 = square(x = sub_6)[name = tensor<string, []>("square_3")];
            tensor<int32, [2]> reduce_mean_11_axes_0 = const()[name = tensor<string, []>("reduce_mean_11_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_11_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_11_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp32, [1, 8, 1, 1]> reduce_mean_11 = reduce_mean(axes = reduce_mean_11_axes_0, keep_dims = reduce_mean_11_keep_dims_0, x = square_3)[name = tensor<string, []>("reduce_mean_11")];
            tensor<fp32, []> add_6_y_0 = const()[name = tensor<string, []>("add_6_y_0"), val = tensor<fp32, []>(0x1.4f8b58p-17)];
            tensor<fp32, [1, 8, 1, 1]> add_6 = add(x = reduce_mean_11, y = add_6_y_0)[name = tensor<string, []>("add_6")];
            tensor<fp32, [1, 8, 1, 1]> sqrt_3 = sqrt(x = add_6)[name = tensor<string, []>("sqrt_3")];
            tensor<fp32, [1, 8, 8, ?]> real_div_3 = real_div(x = sub_6, y = sqrt_3)[name = tensor<string, []>("real_div_3")];
            tensor<fp32, [1, 64, ?]> reshape_13 = reshape(shape = shape_3, x = real_div_3)[name = tensor<string, []>("reshape_13")];
            tensor<fp32, [1, 64, 1]> reshape_14 = const()[name = tensor<string, []>("reshape_14"), val = tensor<fp32, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2771328)))];
            tensor<fp32, [1, 64, ?]> mul_3 = mul(x = reshape_13, y = reshape_14)[name = tensor<string, []>("mul_3")];
            tensor<fp32, [1, 64, 1]> reshape_15 = const()[name = tensor<string, []>("reshape_15"), val = tensor<fp32, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2771648)))];
            tensor<fp32, [1, 64, ?]> add_7 = add(x = mul_3, y = reshape_15)[name = tensor<string, []>("add_7")];
            tensor<fp32, [1, 64, ?]> input_17 = add(x = add_7, y = input_9)[name = tensor<string, []>("input_17")];
            tensor<string, []> input_19_pad_type_0 = const()[name = tensor<string, []>("input_19_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_19_pad_0 = const()[name = tensor<string, []>("input_19_pad_0"), val = tensor<int32, [2]>([3, 3])];
            tensor<int32, [1]> input_19_strides_0 = const()[name = tensor<string, []>("input_19_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_19_dilations_0 = const()[name = tensor<string, []>("input_19_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_19_groups_0 = const()[name = tensor<string, []>("input_19_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [1, 64, ?]> input_19 = conv(bias = blocks_2_conv1_bias, dilations = input_19_dilations_0, groups = input_19_groups_0, pad = input_19_pad_0, pad_type = input_19_pad_type_0, strides = input_19_strides_0, weight = blocks_2_conv1_weight, x = input_17)[name = tensor<string, []>("input_19")];
            tensor<int32, [3]> shape_4 = shape(x = input_19)[name = tensor<string, []>("shape_4")];
            tensor<int32, [4]> concat_4x = const()[name = tensor<string, []>("concat_4x"), val = tensor<int32, [4]>([1, 8, 8, -1])];
            tensor<fp32, [1, 8, 8, ?]> reshape_16 = reshape(shape = concat_4x, x = input_19)[name = tensor<string, []>("reshape_16")];
            tensor<int32, [2]> reduce_mean_12_axes_0 = const()[name = tensor<string, []>("reduce_mean_12_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_12_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_12_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp32, [1, 8, 1, 1]> reduce_mean_12 = reduce_mean(axes = reduce_mean_12_axes_0, keep_dims = reduce_mean_12_keep_dims_0, x = reshape_16)[name = tensor<string, []>("reduce_mean_12")];
            tensor<fp32, [1, 8, 8, ?]> sub_8 = sub(x = reshape_16, y = reduce_mean_12)[name = tensor<string, []>("sub_8")];
            tensor<fp32, [1, 8, 8, ?]> square_4 = square(x = sub_8)[name = tensor<string, []>("square_4")];
            tensor<int32, [2]> reduce_mean_14_axes_0 = const()[name = tensor<string, []>("reduce_mean_14_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_14_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_14_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp32, [1, 8, 1, 1]> reduce_mean_14 = reduce_mean(axes = reduce_mean_14_axes_0, keep_dims = reduce_mean_14_keep_dims_0, x = square_4)[name = tensor<string, []>("reduce_mean_14")];
            tensor<fp32, []> add_8_y_0 = const()[name = tensor<string, []>("add_8_y_0"), val = tensor<fp32, []>(0x1.4f8b58p-17)];
            tensor<fp32, [1, 8, 1, 1]> add_8 = add(x = reduce_mean_14, y = add_8_y_0)[name = tensor<string, []>("add_8")];
            tensor<fp32, [1, 8, 1, 1]> sqrt_4 = sqrt(x = add_8)[name = tensor<string, []>("sqrt_4")];
            tensor<fp32, [1, 8, 8, ?]> real_div_4 = real_div(x = sub_8, y = sqrt_4)[name = tensor<string, []>("real_div_4")];
            tensor<fp32, [1, 64, ?]> reshape_17 = reshape(shape = shape_4, x = real_div_4)[name = tensor<string, []>("reshape_17")];
            tensor<fp32, [1, 64, 1]> reshape_18 = const()[name = tensor<string, []>("reshape_18"), val = tensor<fp32, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2771968)))];
            tensor<fp32, [1, 64, ?]> mul_4 = mul(x = reshape_17, y = reshape_18)[name = tensor<string, []>("mul_4")];
            tensor<fp32, [1, 64, 1]> reshape_19 = const()[name = tensor<string, []>("reshape_19"), val = tensor<fp32, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2772288)))];
            tensor<fp32, [1, 64, ?]> add_9 = add(x = mul_4, y = reshape_19)[name = tensor<string, []>("add_9")];
            tensor<fp32, [1, 64, ?]> input_21 = silu(x = add_9)[name = tensor<string, []>("input_21")];
            tensor<string, []> input_23_pad_type_0 = const()[name = tensor<string, []>("input_23_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_23_pad_0 = const()[name = tensor<string, []>("input_23_pad_0"), val = tensor<int32, [2]>([3, 3])];
            tensor<int32, [1]> input_23_strides_0 = const()[name = tensor<string, []>("input_23_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_23_dilations_0 = const()[name = tensor<string, []>("input_23_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_23_groups_0 = const()[name = tensor<string, []>("input_23_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [1, 64, ?]> input_23 = conv(bias = blocks_2_conv2_bias, dilations = input_23_dilations_0, groups = input_23_groups_0, pad = input_23_pad_0, pad_type = input_23_pad_type_0, strides = input_23_strides_0, weight = blocks_2_conv2_weight, x = input_21)[name = tensor<string, []>("input_23")];
            tensor<int32, [3]> shape_5 = shape(x = input_23)[name = tensor<string, []>("shape_5")];
            tensor<int32, [4]> concat_5x = const()[name = tensor<string, []>("concat_5x"), val = tensor<int32, [4]>([1, 8, 8, -1])];
            tensor<fp32, [1, 8, 8, ?]> reshape_20 = reshape(shape = concat_5x, x = input_23)[name = tensor<string, []>("reshape_20")];
            tensor<int32, [2]> reduce_mean_15_axes_0 = const()[name = tensor<string, []>("reduce_mean_15_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_15_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_15_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp32, [1, 8, 1, 1]> reduce_mean_15 = reduce_mean(axes = reduce_mean_15_axes_0, keep_dims = reduce_mean_15_keep_dims_0, x = reshape_20)[name = tensor<string, []>("reduce_mean_15")];
            tensor<fp32, [1, 8, 8, ?]> sub_10 = sub(x = reshape_20, y = reduce_mean_15)[name = tensor<string, []>("sub_10")];
            tensor<fp32, [1, 8, 8, ?]> square_5 = square(x = sub_10)[name = tensor<string, []>("square_5")];
            tensor<int32, [2]> reduce_mean_17_axes_0 = const()[name = tensor<string, []>("reduce_mean_17_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_17_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_17_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp32, [1, 8, 1, 1]> reduce_mean_17 = reduce_mean(axes = reduce_mean_17_axes_0, keep_dims = reduce_mean_17_keep_dims_0, x = square_5)[name = tensor<string, []>("reduce_mean_17")];
            tensor<fp32, []> add_10_y_0 = const()[name = tensor<string, []>("add_10_y_0"), val = tensor<fp32, []>(0x1.4f8b58p-17)];
            tensor<fp32, [1, 8, 1, 1]> add_10 = add(x = reduce_mean_17, y = add_10_y_0)[name = tensor<string, []>("add_10")];
            tensor<fp32, [1, 8, 1, 1]> sqrt_5 = sqrt(x = add_10)[name = tensor<string, []>("sqrt_5")];
            tensor<fp32, [1, 8, 8, ?]> real_div_5 = real_div(x = sub_10, y = sqrt_5)[name = tensor<string, []>("real_div_5")];
            tensor<fp32, [1, 64, ?]> reshape_21 = reshape(shape = shape_5, x = real_div_5)[name = tensor<string, []>("reshape_21")];
            tensor<fp32, [1, 64, 1]> reshape_22 = const()[name = tensor<string, []>("reshape_22"), val = tensor<fp32, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2772608)))];
            tensor<fp32, [1, 64, ?]> mul_5 = mul(x = reshape_21, y = reshape_22)[name = tensor<string, []>("mul_5")];
            tensor<fp32, [1, 64, 1]> reshape_23 = const()[name = tensor<string, []>("reshape_23"), val = tensor<fp32, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2772928)))];
            tensor<fp32, [1, 64, ?]> add_11 = add(x = mul_5, y = reshape_23)[name = tensor<string, []>("add_11")];
            tensor<fp32, [1, 64, ?]> input_25 = add(x = add_11, y = input_17)[name = tensor<string, []>("input_25")];
            tensor<string, []> input_27_pad_type_0 = const()[name = tensor<string, []>("input_27_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_27_pad_0 = const()[name = tensor<string, []>("input_27_pad_0"), val = tensor<int32, [2]>([3, 3])];
            tensor<int32, [1]> input_27_strides_0 = const()[name = tensor<string, []>("input_27_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_27_dilations_0 = const()[name = tensor<string, []>("input_27_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_27_groups_0 = const()[name = tensor<string, []>("input_27_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [1, 64, ?]> input_27 = conv(bias = blocks_3_conv1_bias, dilations = input_27_dilations_0, groups = input_27_groups_0, pad = input_27_pad_0, pad_type = input_27_pad_type_0, strides = input_27_strides_0, weight = blocks_3_conv1_weight, x = input_25)[name = tensor<string, []>("input_27")];
            tensor<int32, [3]> shape_6 = shape(x = input_27)[name = tensor<string, []>("shape_6")];
            tensor<int32, [4]> concat_6x = const()[name = tensor<string, []>("concat_6x"), val = tensor<int32, [4]>([1, 8, 8, -1])];
            tensor<fp32, [1, 8, 8, ?]> reshape_24 = reshape(shape = concat_6x, x = input_27)[name = tensor<string, []>("reshape_24")];
            tensor<int32, [2]> reduce_mean_18_axes_0 = const()[name = tensor<string, []>("reduce_mean_18_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_18_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_18_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp32, [1, 8, 1, 1]> reduce_mean_18 = reduce_mean(axes = reduce_mean_18_axes_0, keep_dims = reduce_mean_18_keep_dims_0, x = reshape_24)[name = tensor<string, []>("reduce_mean_18")];
            tensor<fp32, [1, 8, 8, ?]> sub_12 = sub(x = reshape_24, y = reduce_mean_18)[name = tensor<string, []>("sub_12")];
            tensor<fp32, [1, 8, 8, ?]> square_6 = square(x = sub_12)[name = tensor<string, []>("square_6")];
            tensor<int32, [2]> reduce_mean_20_axes_0 = const()[name = tensor<string, []>("reduce_mean_20_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_20_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_20_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp32, [1, 8, 1, 1]> reduce_mean_20 = reduce_mean(axes = reduce_mean_20_axes_0, keep_dims = reduce_mean_20_keep_dims_0, x = square_6)[name = tensor<string, []>("reduce_mean_20")];
            tensor<fp32, []> add_12_y_0 = const()[name = tensor<string, []>("add_12_y_0"), val = tensor<fp32, []>(0x1.4f8b58p-17)];
            tensor<fp32, [1, 8, 1, 1]> add_12 = add(x = reduce_mean_20, y = add_12_y_0)[name = tensor<string, []>("add_12")];
            tensor<fp32, [1, 8, 1, 1]> sqrt_6 = sqrt(x = add_12)[name = tensor<string, []>("sqrt_6")];
            tensor<fp32, [1, 8, 8, ?]> real_div_6 = real_div(x = sub_12, y = sqrt_6)[name = tensor<string, []>("real_div_6")];
            tensor<fp32, [1, 64, ?]> reshape_25 = reshape(shape = shape_6, x = real_div_6)[name = tensor<string, []>("reshape_25")];
            tensor<fp32, [1, 64, 1]> reshape_26 = const()[name = tensor<string, []>("reshape_26"), val = tensor<fp32, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2773248)))];
            tensor<fp32, [1, 64, ?]> mul_6 = mul(x = reshape_25, y = reshape_26)[name = tensor<string, []>("mul_6")];
            tensor<fp32, [1, 64, 1]> reshape_27 = const()[name = tensor<string, []>("reshape_27"), val = tensor<fp32, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2773568)))];
            tensor<fp32, [1, 64, ?]> add_13 = add(x = mul_6, y = reshape_27)[name = tensor<string, []>("add_13")];
            tensor<fp32, [1, 64, ?]> input_29 = silu(x = add_13)[name = tensor<string, []>("input_29")];
            tensor<string, []> input_31_pad_type_0 = const()[name = tensor<string, []>("input_31_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_31_pad_0 = const()[name = tensor<string, []>("input_31_pad_0"), val = tensor<int32, [2]>([3, 3])];
            tensor<int32, [1]> input_31_strides_0 = const()[name = tensor<string, []>("input_31_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_31_dilations_0 = const()[name = tensor<string, []>("input_31_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_31_groups_0 = const()[name = tensor<string, []>("input_31_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [1, 64, ?]> input_31 = conv(bias = blocks_3_conv2_bias, dilations = input_31_dilations_0, groups = input_31_groups_0, pad = input_31_pad_0, pad_type = input_31_pad_type_0, strides = input_31_strides_0, weight = blocks_3_conv2_weight, x = input_29)[name = tensor<string, []>("input_31")];
            tensor<int32, [3]> shape_7 = shape(x = input_31)[name = tensor<string, []>("shape_7")];
            tensor<int32, [4]> concat_7x = const()[name = tensor<string, []>("concat_7x"), val = tensor<int32, [4]>([1, 8, 8, -1])];
            tensor<fp32, [1, 8, 8, ?]> reshape_28 = reshape(shape = concat_7x, x = input_31)[name = tensor<string, []>("reshape_28")];
            tensor<int32, [2]> reduce_mean_21_axes_0 = const()[name = tensor<string, []>("reduce_mean_21_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_21_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_21_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp32, [1, 8, 1, 1]> reduce_mean_21 = reduce_mean(axes = reduce_mean_21_axes_0, keep_dims = reduce_mean_21_keep_dims_0, x = reshape_28)[name = tensor<string, []>("reduce_mean_21")];
            tensor<fp32, [1, 8, 8, ?]> sub_14 = sub(x = reshape_28, y = reduce_mean_21)[name = tensor<string, []>("sub_14")];
            tensor<fp32, [1, 8, 8, ?]> square_7 = square(x = sub_14)[name = tensor<string, []>("square_7")];
            tensor<int32, [2]> reduce_mean_23_axes_0 = const()[name = tensor<string, []>("reduce_mean_23_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_23_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_23_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp32, [1, 8, 1, 1]> reduce_mean_23 = reduce_mean(axes = reduce_mean_23_axes_0, keep_dims = reduce_mean_23_keep_dims_0, x = square_7)[name = tensor<string, []>("reduce_mean_23")];
            tensor<fp32, []> add_14_y_0 = const()[name = tensor<string, []>("add_14_y_0"), val = tensor<fp32, []>(0x1.4f8b58p-17)];
            tensor<fp32, [1, 8, 1, 1]> add_14 = add(x = reduce_mean_23, y = add_14_y_0)[name = tensor<string, []>("add_14")];
            tensor<fp32, [1, 8, 1, 1]> sqrt_7 = sqrt(x = add_14)[name = tensor<string, []>("sqrt_7")];
            tensor<fp32, [1, 8, 8, ?]> real_div_7 = real_div(x = sub_14, y = sqrt_7)[name = tensor<string, []>("real_div_7")];
            tensor<fp32, [1, 64, ?]> reshape_29 = reshape(shape = shape_7, x = real_div_7)[name = tensor<string, []>("reshape_29")];
            tensor<fp32, [1, 64, 1]> reshape_30 = const()[name = tensor<string, []>("reshape_30"), val = tensor<fp32, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2773888)))];
            tensor<fp32, [1, 64, ?]> mul_7 = mul(x = reshape_29, y = reshape_30)[name = tensor<string, []>("mul_7")];
            tensor<fp32, [1, 64, 1]> reshape_31 = const()[name = tensor<string, []>("reshape_31"), val = tensor<fp32, [1, 64, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2774208)))];
            tensor<fp32, [1, 64, ?]> add_15 = add(x = mul_7, y = reshape_31)[name = tensor<string, []>("add_15")];
            tensor<fp32, [1, 64, ?]> input_33 = add(x = add_15, y = input_25)[name = tensor<string, []>("input_33")];
            tensor<string, []> input_35_pad_type_0 = const()[name = tensor<string, []>("input_35_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_35_pad_0 = const()[name = tensor<string, []>("input_35_pad_0"), val = tensor<int32, [2]>([3, 3])];
            tensor<int32, [1]> input_35_strides_0 = const()[name = tensor<string, []>("input_35_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> input_35_dilations_0 = const()[name = tensor<string, []>("input_35_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_35_groups_0 = const()[name = tensor<string, []>("input_35_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [1, 64, ?]> input_35 = conv(bias = blocks_4_conv1_bias, dilations = input_35_dilations_0, groups = input_35_groups_0, pad = input_35_pad_0, pad_type = input_35_pad_type_0, strides = input_35_strides_0, weight = blocks_4_conv1_weight, x = input_33)[name = tensor<string, []>("input_35")];
            tensor<int32, [3]> shape_8 = shape(x = input_35)[name = tensor<string, []>("shape_8")];
            tensor<int32, [4]> concat_8x = const()[name = tensor<string, []>("concat_8x"), val = tensor<int32, [4]>([1, 8, 8, -1])];
            tensor<fp32, [1, 8, 8, ?]> reshape_32 = reshape(shape = concat_8x, x = input_35)[name = tensor<string, []>("reshape_32")];
            tensor<int32, [2]> reduce_mean_24_axes_0 = const()[name = tensor<string, []>("reduce_mean_24_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_24_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_24_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp32, [1, 8, 1, 1]> reduce_mean_24 = reduce_mean(axes = reduce_mean_24_axes_0, keep_dims = reduce_mean_24_keep_dims_0, x = reshape_32)[name = tensor<string, []>("reduce_mean_24")];
            tensor<fp32, [1, 8, 8, ?]> sub_16 = sub(x = reshape_32, y = reduce_mean_24)[name = tensor<string, []>("sub_16")];
            tensor<fp32, [1, 8, 8, ?]> square_8 = square(x = sub_16)[name = tensor<string, []>("square_8")];
            tensor<int32, [2]> reduce_mean_26_axes_0 = const()[name = tensor<string, []>("reduce_mean_26_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_26_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_26_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp32, [1, 8, 1, 1]> reduce_mean_26 = reduce_mean(axes = reduce_mean_26_axes_0, keep_dims = reduce_mean_26_keep_dims_0, x = square_8)[name = tensor<string, []>("reduce_mean_26")];
